//Fri Jul 12 2024 14:08:26 GMT+0000 (Coordinated Universal Time)
//Base:https://github.com/echo094/decode-js
//Modify:https://github.com/smallfawn/decode_action
const _0x457fc7 = new _0x5bcdd6("追书神器");
let _0x191186 = ["\n", "@"],
  _0x2d24b1,
  _0x5a033e,
  _0x27354f,
  _0x3c09af = (_0x457fc7.isNode() ? process.env.zssqCookie : _0x457fc7.getdata("zssqCookie")) || "",
  _0x18c954 = [],
  _0x35990f = 0,
  _0x424318 = 0,
  _0x51395c = 1.01,
  _0x385a19 = 0,
  _0x496daa = "zssq",
  _0x1a2304 = "https://leafxcy.coding.net/p/validcode/d/validCode/git/raw/master/code.json";
const _0x9469df = {
  keys: "《庆余年》中范闲的父亲是谁？",
  answer: "庆帝"
};
const _0x1aca8e = {
  keys: "萨顶顶演唱歌曲《左手指月》是以下哪部影视剧的片尾曲？",
  answer: "香蜜沉沉烬如霜"
};
const _0x17f6d2 = {
  keys: "古力娜扎在影视剧《择天记》中，饰演了哪一个角色？",
  answer: "徐有容"
};
const _0x215773 = {
  keys: "鹿晗主演的玄幻影视剧《择天记》的原著作者是？",
  answer: "猫腻"
};
const _0x3b6407 = {
  keys: "作为书中的一个百年一遇的天才，你应该？",
  answer: "低调行事，避免成炮灰送命"
};
const _0x2c18cc = {
  keys: "网剧《我叫余欢水》改编自以下哪部小说？",
  answer: "如果没有明天"
};
const _0x59e9d9 = {
  keys: "玄幻小说剧《斗罗大陆》中唐三与小舞初遇的地点是？",
  answer: "诺丁学院"
};
const _0x1c6840 = {
  keys: "影视剧《旋风少女》中饰演若白一角的演员是谁？",
  answer: "杨洋"
};
const _0x51253c = {
  keys: "《传闻中的陈芊芊》中陈芊芊的青梅竹马是",
  answer: "裴恒"
};
const _0x281f15 = {
  keys: "电影《晴雅集》改编自日本哪位作家的同名作品？",
  answer: "梦枕貘"
};
const _0x29c21f = {
  keys: "《我有一座冒险屋》中主角常用的武器是什么？",
  answer: "大锤"
};
const _0x44b9b7 = {
  keys: "小说《全职高手》的作者是？",
  answer: "蝴蝶蓝"
};
const _0x58a361 = {
  keys: "“第四天灾流”小说中的第四天灾指的是？",
  answer: "玩家"
};
const _0x3b9c40 = {
  keys: "《吞噬星空》主角罗峰成为宇宙之主后，自称__？",
  answer: "银河领主"
};
const _0x3a436a = {
  keys: "以下哪位作家不是悬疑小说作家？",
  answer: "江南"
};
const _0x2fca0 = {
  keys: "《大主宰》《斗破苍穹》等作品的作者笔名“天蚕土豆”出自其家乡小吃：",
  answer: "狼牙土豆"
};
const _0x1b4969 = {
  keys: "唐家三少的《生肖守护神》哪个属相是“老大”？",
  answer: "麒麟"
};
const _0x15735b = {
  keys: "《亏成首富从游戏开始》中主角公司有一个宅男每次都因为莫名其妙的原因而被奖励外出旅行，不是在旅行就是在去旅行的路上，这位宅男是",
  answer: "旅行者包旭"
};
const _0x5b6ad3 = {
  keys: "《斗破苍穹》纳兰嫣然为什么会和主角萧炎悔婚？",
  answer: "没有实力"
};
const _0x53913b = {
  keys: "下列哪本小说的爱情故事没有经历多个轮回？",
  answer: "三生门"
};
const _0x15dc7f = {
  keys: "《武道宗师》因为其中爱情情节的描写，又被称为《__宗师》？",
  answer: "狗粮"
};
const _0x3c677d = {
  keys: "《修真聊天群》主角霸刀宋壹因为恐高，无法御刀而行，所以打算给自己的刀装上什么？",
  answer: "护栏"
};
const _0x35a0bc = {
  keys: "主角穿越之后在天上飘了十几万年才下来的小说，是以下哪一本？",
  answer: "黎明之剑"
};
const _0x25bfea = {
  keys: "以下哪个人物不是出自作家天下霸唱的作品？",
  answer: "王建国"
};
const _0x4bc6f2 = {
  keys: "《超神宠兽店》是近期值得一看的战宠文，这本书的作者还创作了知名黑暗文《黑暗王者》，请问作者是？",
  answer: "古羲"
};
const _0x53f29f = {
  keys: "在网剧《狐狸的夏天》中谭松韵饰演了哪一个角色？",
  answer: "黎晏书"
};
const _0x34ef24 = {
  keys: "男频中出现男主不带感情的推倒很多妹子的情节一般出现在什么类型的小说中？",
  answer: "种马文"
};
const _0x23b33e = {
  keys: "《隐秘的角落》原著小说叫什么名字",
  answer: "坏小孩"
};
const _0x5d8c7e = {
  keys: "“白前辈保佑”出自于哪本小说？",
  answer: "《修真聊天群》"
};
const _0x183de3 = {
  keys: "《一起来看流星雨》中饰演“慕容云海”一角的演员是？",
  answer: "张翰"
};
const _0x465036 = {
  keys: "《古董局中局》和《长安十二时辰》是同一人的作品吗？",
  answer: "是"
};
const _0x5e2638 = {
  keys: "穿到皇宫，你可以在皇后和贵妃之间选择一个身份，你应该",
  answer: "选贵妃，从宫斗剧看贵妃一定更受宠"
};
const _0x269523 = {
  keys: "电影《晴雅集》中饰演饰演“公主”的演员是？",
  answer: "王子文"
};
const _0x4de943 = {
  keys: "哪本书的主角是诸天万族的劫？",
  answer: "万族之劫"
};
const _0x14d605 = {
  keys: "《鬼吹灯》的作者是谁",
  answer: "天下霸唱"
};
const _0x31c25e = {
  keys: "网剧《我就是这般女子》女主角是谁饰演的？",
  answer: "关晓彤"
};
const _0x39d09b = {
  keys: "马伯庸说《长安十二时辰》的脑洞原型来自什么",
  answer: "刺客信条"
};
const _0x4ea6f4 = {
  keys: "下列作品中，不是现实题材的是？",
  answer: "《最强狂兵》"
};
const _0x1acc6e = {
  keys: "以下影视剧中哪部不属于由作家桐华的作品改编？",
  answer: "东宫"
};
const _0x13a032 = {
  keys: "电影《少年的你》改编自以下哪位作者的小说作品？",
  answer: "玖月晞"
};
const _0x102748 = {
  keys: "以下哪本是古穿今？",
  answer: "《新唐遗玉》"
};
const _0x3e7e49 = {
  keys: "《全球高武》主人公方平是哪国人？",
  answer: "华国"
};
const _0x254609 = {
  keys: "《狂神》的作者是谁？",
  answer: "唐家三少"
};
const _0x4e8a4f = {
  keys: "以下哪些演员没有饰演过张起灵？",
  answer: "吴磊"
};
const _0x53a2a4 = {
  keys: "开启总裁文一脉的是以下哪本书？",
  answer: "《泡沫之夏》"
};
const _0x5364ee = {
  keys: "《史上第一混乱》是反穿越的代表作之一，这本小说是哪里的人物穿越到现代发生的爆笑故事？",
  answer: "古代"
};
const _0x502fe5 = {
  keys: "仙侠小说《大奉打更人》中，作者加入了悬疑探案类元素，十分吸引人。请问主角开场遇到的第一个案件是？",
  answer: "税银丢失案"
};
const _0x46f2c1 = {
  keys: "《都市极品医神》的主角叫什么？",
  answer: "叶辰"
};
const _0x22c841 = {
  keys: "《遮天》中狠人大帝“不为成仙，只为红尘中等你归来。”，等待的是谁？",
  answer: "哥哥"
};
const _0xeb762 = {
  keys: "《从零开始》更新了数年，近两千万字，才终于完结。请问从零开始更新了几年？",
  answer: "11年"
};
const _0x49d16d = {
  keys: "《悟空传》的作者叫什么",
  answer: "今何在"
};
const _0x3c59bc = {
  keys: "以下不是南派三叔的作品的是？",
  answer: "《庆余年》"
};
const _0x47c584 = {
  keys: "由张杰演唱歌曲《剑心》是以下哪部电视剧的主题曲？",
  answer: "古剑奇谭"
};
const _0x2ab601 = {
  keys: "《美食供应商》中男主拥有什么系统？",
  answer: "厨神系统"
};
const _0x39f5ec = {
  keys: "以下哪位明星没有饰演过“夜华”这一角色？",
  answer: "王一博"
};
const _0x2ebe82 = {
  keys: "“我只想当个酒馆老板，李世民却总跑来问我什么治国良策，什么？还要请我出山治国？”这本小说是？",
  answer: "大唐国士无双"
};
const _0x3d84f9 = {
  keys: "穿越成哈士奇的秦小白看着眼前要给它洗澡的美女主播主人，陷入了沉思。请问这本小说是？",
  answer: "《直播：女神家的哈士奇天秀》"
};
const _0x5c0794 = {
  keys: "主角穿越之后在天上飘了十几万年才下来的小说，是以下哪一本？",
  answer: "黎明之剑"
};
const _0x4cbc94 = {
  keys: "《史上最强炼气期》的主角叫？",
  answer: "方羽"
};
const _0x2eda31 = {
  keys: "下列哪个小说的主角不是身体残障人士？",
  answer: "唐三"
};
const _0x24b8f0 = {
  keys: "请问钮钴禄甄嬛和魏璎珞是什么关系？",
  answer: "婆媳"
};
const _0x566dc0 = {
  keys: "被誉为悬疑言情小说天后的作者是？",
  answer: "丁墨"
};
const _0x27dd09 = {
  keys: "一个靠着垂钓系统把自己钓出了“科技巨头”并拯救地球的小说是以下哪本？",
  answer: "《玩坏世界的垂钓者》"
};
const _0x20714f = {
  keys: "天蚕土豆的哪本小说男主从小就对女主进行“马杀鸡”？",
  answer: "《斗破苍穹》"
};
const _0x515b84 = {
  keys: "小说中《斗罗大陆》中史莱克学院的口号是什么？",
  answer: "只收怪物"
};
const _0x50db72 = {
  keys: "袁冰妍在影视剧《听雪楼》中，饰演了哪一个角色？",
  answer: "舒靖容"
};
const _0x29bdb2 = {
  keys: "电影《晴雅集》中饰演博雅一角的演员是？",
  answer: "邓伦"
};
const _0x5d5cee = {
  keys: "《龙族》的主角是谁？",
  answer: "路明非"
};
const _0x432e6f = {
  keys: "请问女主女扮男装，男主怎么才可以知道她是个女孩子？",
  answer: "摸胸"
};
const _0x519c1a = {
  keys: "网剧《三千鸦杀》中男主傅九云的真实身份是？",
  answer: "灵灯灯芯"
};
const _0x54e752 = {
  keys: "《轮回乐园》作为一本长期霸榜的漫综无限流作品，即将突破1000万字。请问这本小说的作者是？",
  answer: "那一只蚊子"
};
const _0x41e950 = {
  keys: "《我师兄实在太稳健了》主角半夜爬进师妹房间，为了——？",
  answer: "补习"
};
const _0x474dc9 = {
  keys: "电视就《狼殿下》中肖战饰演了哪一个角色？",
  answer: "疾冲"
};
const _0x367631 = {
  keys: "作者\"我吃西红柿”的作品《盘龙》中的盘龙指的是？",
  answer: "戒指"
};
const _0x1508f9 = {
  keys: "以下哪本书是宅猪的作品",
  answer: "帝尊"
};
const _0x160fc6 = {
  keys: "以下哪种小说题材还没有拍过？",
  answer: "种田"
};
const _0x2f61e5 = {
  keys: "《传闻中的陈芊芊》中陈芊芊是几公主",
  answer: "三公主"
};
const _0x2381af = {
  keys: "“整容式演技”最初是用于形容以下哪位演员的演技？",
  answer: "赵又廷"
};
const _0x23dd7f = {
  keys: "网文改编剧《华胥引》的原著作者是？",
  answer: "唐七"
};
const _0x265166 = {
  keys: "电视剧《三生三世十里桃花》里，白浅的武器是？",
  answer: "玉清昆仑扇"
};
const _0x39ec7c = {
  keys: "《土豪系统在都市》中杨昊带小丫王者开黑时用的什么英雄？",
  answer: "亚瑟"
};
const _0x1ad72d = {
  keys: "《修真聊天群》主角霸刀宋壹因为恐高，无法御刀而行，所以打算给自己的刀装上什么？",
  answer: "护栏"
};
const _0x2ff681 = {
  keys: "请问钮钴禄甄嬛和魏璎珞是什么关系？",
  answer: "婆媳"
};
const _0x39f4a1 = {
  keys: "主角靠演技去扮演大佬获取资源提升自己，是以下哪本书的套路？",
  answer: "《我是演员》"
};
const _0x4f598b = {
  keys: "《斗破苍穹》纳兰嫣然为什么会和主角萧炎悔婚？",
  answer: "没有实力"
};
const _0x5d58f7 = {
  keys: "电视剧《甄嬛传》的原著小说作者是？",
  answer: "流潋紫"
};
const _0x1b3144 = {
  keys: "以下哪部影视剧不属于由作家猫腻的小说作品改编？",
  answer: "《香蜜沉沉烬如霜》"
};
const _0x60a879 = {
  keys: "影视剧《都挺好》中女主的“作爹”叫什么名字",
  answer: "苏大强"
};
const _0x47ac45 = {
  keys: "以下影视中哪部不属于由顾漫作品改编？",
  answer: "冰糖炖雪梨"
};
const _0x3c2fb3 = {
  keys: "杨幂在影视剧《美人心计》中饰演了哪个角色？",
  answer: "莫雪鸢"
};
const _0x2423e7 = {
  keys: "你穿成了一个正在和亲路上的公主，你应该？",
  answer: "高度警惕，等待刺杀劫亲剧情"
};
const _0x227b5c = {
  keys: "《三体》中将人类二维化的宇宙飞船叫什么？",
  answer: "二向箔"
};
const _0xa5022b = {
  keys: "你突然穿回了90年代，你应该？",
  answer: "煽动全家买股票，全仓白酒"
};
const _0x2cf847 = {
  keys: "成毅在网剧《琉璃》中饰演的角色是？",
  answer: "禹司凤"
};
const _0xfc5cf2 = {
  keys: "作为书中的一个百年一遇的天才，你应该？",
  answer: "低调行事，避免成炮灰送命"
};
const _0x4c3e27 = {
  keys: "《武道宗师》因为其中爱情情节的描写，又被称为《__宗师》？",
  answer: "狗粮"
};
const _0x418618 = {
  keys: "以下哪本小说的故事没有发生在架空世界？",
  answer: "活着"
};
const _0xa6e5b3 = {
  keys: "主角靠演技去扮演大佬获取资源提升自己，是以下哪本书的套路？",
  answer: "《我是演员》"
};
const _0x3334d5 = {
  keys: "《史上最强炼气期》主角五千年一直停留在炼气期无法筑基，寿命却几乎无限。请问主角的炼气期大概修炼到了多少层？",
  answer: "练气八千层"
};
const _0x1c459f = {
  keys: "《大主宰》《斗破苍穹》等作品的作者笔名“天蚕土豆”出自其家乡小吃：",
  answer: "狼牙土豆"
};
const _0x586b27 = {
  keys: "异能者不是人类而是一群猫，这样的世界是以下哪本小说？",
  answer: "《难道是我是神》"
};
const _0x403a84 = {
  keys: "小说《全职高手》的作者是？",
  answer: "蝴蝶蓝"
};
const _0x5a410a = {
  keys: "《吞噬星空》主角罗峰成为宇宙之主后，自称__？",
  answer: "银河领主"
};
const _0x59485c = {
  keys: "《全职法师》中的主角莫凡是什么职业？",
  answer: "魔法师"
};
const _0x1e7cc4 = {
  keys: "《仙逆》主角修炼最大的特色是：",
  answer: "化凡"
};
const _0x5107e5 = {
  keys: "小说中《斗罗大陆》中史莱克学院的口号是什么？",
  answer: "只收怪物"
};
const _0x5e60b5 = {
  keys: "以下哪本小说中的女主角唱歌很好听？",
  answer: "很想很想你"
};
const _0x4a8956 = {
  keys: "《亏成首富从游戏开始》中主角公司有一个宅男每次都因为莫名其妙的原因而被奖励外出旅行，不是在旅行就是在去旅行的路上，这位宅男是",
  answer: "旅行者包旭"
};
const _0x3a5f6c = {
  keys: "小说《诛仙》里主角身边的动物是什么？",
  answer: "猴"
};
const _0x279dff = {
  keys: "《星戒》小说中炎日刀君的弟弟叫什么名字？",
  answer: "苍月刀君"
};
const _0x3108eb = {
  keys: "突然穿回到小学，你应该？",
  answer: "一年跳5级，顺带发家致富招小弟"
};
const _0xb7aa51 = {
  keys: "你穿越的到古代皇宫成了一名妃子，你应该？",
  answer: "花式宫斗，争取做到皇太后"
};
const _0x324150 = {
  keys: "你穿成了一个正在和亲路上的公主，你应该？",
  answer: "高度警惕，等待刺杀劫亲剧情"
};
const _0x2081fb = {
  keys: "在总裁文中，进错包厢被当成酒托，你应该？",
  answer: "将错就错，成功吸引霸总男主注意"
};
const _0x1d2958 = {
  keys: "《三体》中将人类二维化的宇宙飞船叫什么？",
  answer: "二向箔"
};
const _0x3a89c7 = {
  keys: "小说《赘婿》改编的电视剧男主角是？",
  answer: "郭麒麟"
};
const _0x972847 = {
  keys: "《仙逆》主角修炼最大的特色是：",
  answer: "化凡"
};
const _0x4aab2f = {
  keys: "以下哪个说法指的是“系统流”小说？",
  answer: "描述主角有个系统，并且帮助自己升级的小说。"
};
const _0x4e0237 = {
  keys: "以下哪部电影不是由小说改编而成？",
  answer: "滚蛋吧肿瘤君"
};
const _0xa5a859 = {
  keys: "《亏成首富从游戏开始》中主角公司有一个宅男每次都因为莫名其妙的原因而被奖励外出旅行，不是在旅行就是在去旅行的路上，这位宅男是",
  answer: "旅行者包旭"
};
const _0x23a758 = {
  keys: "“天不生我李淳罡，剑道万古长如夜”这句话出自哪本书？",
  answer: "雪中悍刀行"
};
const _0x235d9c = {
  keys: "《帝霸》主角为了找丢失的__误入疯魔洞？",
  answer: "羊"
};
const _0x5d4b5d = {
  keys: "小说《赘婿》改编的电视剧男主角是？",
  answer: "郭麒麟"
};
const _0xa3ca12 = {
  keys: "下列哪个小说的主角不是身体残障人士？",
  answer: "唐三"
};
const _0x51be71 = {
  keys: "以下哪个说法指的是“系统流”小说？",
  answer: "描述主角有个系统，并且帮助自己升级的小说。"
};
const _0x2c2c46 = {
  keys: "你穿成了一个正在和亲路上的公主，你应该？",
  answer: "高度警惕，等待刺杀劫亲剧情"
};
const _0x48348a = {
  keys: "《三体》中将人类二维化的宇宙飞船叫什么？",
  answer: "二向箔"
};
const _0x3aa452 = {
  keys: "你突然穿回了90年代，你应该？",
  answer: "煽动全家买股票，全仓白酒"
};
const _0xa96d6d = {
  keys: "成毅在网剧《琉璃》中饰演的角色是？",
  answer: "禹司凤"
};
const _0xfb86ef = {
  keys: "作为书中的一个百年一遇的天才，你应该？",
  answer: "低调行事，避免成炮灰送命"
};
const _0x54ccaf = {
  keys: "穿到皇宫，你可以在皇后和贵妃之间选择一个身份，你应该",
  answer: "选贵妃，从宫斗剧看贵妃一定更受宠"
};
const _0x2385a2 = {
  keys: "在晋江纯爱文中，男主一般会有几位夫人？",
  answer: "男主没有夫人，只有男人"
};
const _0x456595 = {
  keys: "《庆余年》中范闲的父亲是谁？",
  answer: "庆帝"
};
const _0x1eae33 = {
  keys: "萨顶顶演唱歌曲《左手指月》是以下哪部影视剧的片尾曲？",
  answer: "香蜜沉沉烬如霜"
};
const _0x18509a = {
  keys: "古力娜扎在影视剧《择天记》中，饰演了哪一个角色？",
  answer: "徐有容"
};
const _0x3efd77 = {
  keys: "以下哪个人物是《斗罗大陆》中的女主角？",
  answer: "小舞"
};
const _0x2960e8 = {
  keys: "与《斗破苍穹》内容无关的小说是",
  answer: "庆余年"
};
const _0x33d19f = {
  keys: "《斗破苍穹》电视剧萧炎是谁扮演的？",
  answer: "吴磊"
};
const _0x30f613 = {
  keys: "《风声》的作者是谁？",
  answer: "麦家"
};
const _0x4b9d79 = {
  keys: "《隐秘的角落》原著是谁的小说？",
  answer: "紫金陈"
};
const _0xc628f9 = {
  keys: "《沙海》与《盗墓笔记》的关系是",
  answer: "后传"
};
const _0x191876 = {
  keys: "《灵域》女主角凌语诗电视剧扮演者是谁？",
  answer: "程潇"
};
const _0xb409f6 = {
  keys: "以下哪本是古穿今？",
  answer: "《新唐遗玉》"
};
const _0x374def = {
  keys: "《全球高武》主人公方平是哪国人？",
  answer: "华国"
};
const _0x21fdfb = {
  keys: "《狂神》的作者是谁？",
  answer: "唐家三少"
};
const _0x4da761 = {
  keys: "《吞噬星空》的故事，发生在什么年代？",
  answer: "未来"
};
const _0x4ed970 = {
  keys: "请问古代太医一把脉说的一句话是什么？",
  answer: "有喜了"
};
const _0x126637 = {
  keys: "章子怡在影视剧《上阳赋》中饰演了哪一个角色？",
  answer: "王儇"
};
const _0x3eb21b = {
  keys: "《长安十二时辰》中易烊千玺扮演的角色叫什么",
  answer: "李必"
};
const _0x2ecf8c = {
  keys: "《星辰变》的主角秦羽，有两个妖兽兄弟。是什么动物？",
  answer: "鹰和猿"
};
const _0x379c84 = {
  keys: "影视剧《都挺好》中女主的“作爹”叫什么名字",
  answer: "苏大强"
};
const _0x230c58 = {
  keys: "“整容式演技”最初是用于形容以下哪位演员的演技？",
  answer: "赵又廷"
};
const _0x9717a1 = {
  keys: "电视剧《三生三世十里桃花》里，杨幂一人分饰几角？",
  answer: "4"
};
const _0x35112c = {
  keys: "网文改编剧《华胥引》的原著作者是？",
  answer: "唐七"
};
const _0x28ba93 = {
  keys: "电视剧《甄嬛传》的原著小说作者是？",
  answer: "流潋紫"
};
const _0x2b1945 = {
  keys: "“遭遇突变、伤心难过时冲到外面，一定是打雷下暴雨”这类情节称之为___?",
  answer: "撒狗血"
};
const _0x3cec5c = {
  keys: "《恶魔法则》的男主角叫什么",
  answer: "杜维"
};
const _0x26602f = {
  keys: "网剧《我就是这般的女子》改编自以下哪部小说？",
  answer: "我就是这般的女子"
};
const _0x5ac155 = {
  keys: "《灵域》作者是谁？",
  answer: "逆苍天"
};
const _0x19d5b4 = {
  keys: "猜书名：“震惊！一男子男女通吃，一人妖为爱变性”",
  answer: "《修真聊天群》"
};
const _0x472fc7 = {
  keys: "电视剧《三生三世十里桃花》里，杨幂一人分饰几角？",
  answer: "4"
};
const _0x4db62e = {
  keys: "网文改编剧《华胥引》的原著作者是？",
  answer: "唐七"
};
const _0x398bc4 = {
  keys: "电视剧《甄嬛传》的原著小说作者是？",
  answer: "流潋紫"
};
const _0x2cf39b = {
  keys: "以下哪部影视剧不属于由作家猫腻的小说作品改编？",
  answer: "《香蜜沉沉烬如霜》"
};
const _0x1521ad = {
  keys: "《盗墓笔记》的张起灵的别称叫什么",
  answer: "闷油瓶"
};
const _0x4e43e9 = {
  keys: "《何以笙箫默》中男女主角分别是什么职业？",
  answer: "律师与摄影师"
};
const _0x5c3097 = {
  keys: "网剧《我就是这般的女子》改编自以下哪部小说？",
  answer: "我就是这般的女子"
};
const _0x4a1ec0 = {
  keys: "《遮天》中，我儿王腾，有____?",
  answer: "大帝之姿"
};
const _0x214f83 = {
  keys: "《圣墟》中，神秘老人所认定的“地球真子”的名字叫什么？",
  answer: "周尚"
};
const _0x340941 = {
  keys: "猜书名：“震惊！一男子男女通吃，一人妖为爱变性”",
  answer: "《修真聊天群》"
};
const _0x305f88 = {
  keys: "在2016年出品的影视剧《我的前半生》中，袁泉饰演了哪一个角色？",
  answer: "唐晶"
};
const _0xb808f9 = {
  keys: "穿越到异世界首先应该干什么？",
  answer: "赶紧检查下有没有系统"
};
const _0x14d62c = {
  keys: "《隐秘的角落》原著是谁的小说？",
  answer: "紫金陈"
};
const _0x1b19c5 = {
  keys: "影视剧《香蜜沉沉烬如霜》的原著小说作者是？",
  answer: "电线"
};
const _0x5b7d38 = {
  keys: "与《斗破苍穹》内容无关的小说是",
  answer: "庆余年"
};
const _0x4b3590 = {
  keys: "请问小燕子和魏璎珞儿子的妻子之间是什么关系？",
  answer: "妯娌"
};
const _0x32a93c = {
  keys: "哪部不是囧囧有妖的作品？",
  answer: "《微微一笑很倾城》"
};
const _0x316b83 = {
  keys: "猜书名：“可怕！一男子居然和锅生了条鱼”",
  answer: "《异常生物见闻录》"
};
const _0x33bb6e = {
  keys: "《冒牌大英雄》的作者是？",
  answer: "七十二编"
};
const _0x415ad6 = {
  keys: "修真小说中以下哪个境界最高？",
  answer: "元婴期"
};
const _0x15595a = {
  keys: "《吞噬星空》主角罗峰成为宇宙之主后，自称__？",
  answer: "银河领主"
};
const _0x12e9a3 = {
  keys: "请问钮钴禄甄嬛和魏璎珞是什么关系？",
  answer: "婆媳"
};
const _0x47dcc0 = {
  keys: "被誉为悬疑言情小说天后的作者是？",
  answer: "丁墨"
};
const _0x4c5469 = {
  keys: "一个靠着垂钓系统把自己钓出了“科技巨头”并拯救地球的小说是以下哪本？",
  answer: "《玩坏世界的垂钓者》"
};
const _0x5c20c1 = {
  keys: "天蚕土豆的哪本小说男主从小就对女主进行“马杀鸡”？",
  answer: "《斗破苍穹》"
};
const _0x36424a = {
  keys: "猜书名：“可怕！一男子居然和锅生了条鱼”",
  answer: "《异常生物见闻录》"
};
const _0x227b90 = {
  keys: "《全球高武》主人公方平是哪国人？",
  answer: "华国"
};
const _0x14b4da = {
  keys: "以下哪位明星没有饰演过“夜华”这一角色？",
  answer: "王一博"
};
const _0x5a58ff = {
  keys: "《终极笔记》中谁扮演吴邪？",
  answer: "曾舜晞"
};
const _0x3e062a = {
  keys: "《长安十二时辰》中易烊千玺扮演的角色叫什么",
  answer: "李必"
};
const _0x37c71f = {
  keys: "《凤囚凰》中容止将司马相如写给卓文君的情诗念给谁听？",
  answer: "楚玉"
};
const _0x42959e = {
  keys: "《没钱上大学的我只能去屠龙了》被许多读者称为近似《xx》原著的同人文!请问xx是哪部作品",
  answer: "龙族"
};
const _0x5d5ec7 = {
  keys: "以下哪位作者是女性？",
  answer: "陈词懒调"
};
const _0x5eb4a4 = {
  keys: "《无限恐怖》中，主角郑吒经历的第一个恐怖世界是？",
  answer: "生化危机"
};
const _0x5655de = {
  keys: "《凡人修仙传》主角韩立的绰号是？",
  answer: "韩跑跑"
};
const _0x437b10 = {
  keys: "玄幻小说《斗罗大陆》中女主角小舞的第一魂技是？",
  answer: "腰弓"
};
const _0x3a6531 = {
  keys: "你在路边捡到一个古早游戏光盘，你应该？",
  answer: "找个光驱启动游戏，准备迎接系统绑定"
};
const _0x2a4999 = {
  keys: "网剧《琉璃》的原著小说是？",
  answer: "琉璃美人煞"
};
const _0x4add85 = {
  keys: "《雪中悍刀行》中徐凤年的扮演者是谁？",
  answer: "张若昀"
};
const _0x1703c4 = {
  keys: "《鬼吹灯》的作者是谁",
  answer: "天下霸唱"
};
const _0x1a8a1d = {
  keys: "电影《少年的你》改编自以下哪位作者的小说作品？",
  answer: "玖月晞"
};
const _0x57ba55 = {
  keys: "以下哪本书的外挂，不是“老爷爷”的。",
  answer: "我真不是大明星"
};
const _0x5f5976 = {
  keys: "《吞噬星空》的作者是谁？",
  answer: "我吃西红柿"
};
const _0xadebaf = {
  keys: "影视剧《上阳赋》的原著小说叫什么？",
  answer: "帝王业"
};
const _0x1720d7 = {
  keys: "废土流小说属于？",
  answer: "求生小说"
};
const _0x3f176f = {
  keys: "《圣墟》的主角叫什么？",
  answer: "楚风"
};
const _0xe3d1fd = {
  keys: "《斗罗大陆》唐三的封号是什么？",
  answer: "千手斗罗"
};
const _0xbc4bc9 = {
  keys: "异能者不是人类而是一群猫，这样的世界是以下哪本小说？",
  answer: "《难道是我是神》"
};
const _0x54a355 = {
  keys: "小说《全职高手》的作者是？",
  answer: "蝴蝶蓝"
};
const _0x288d0a = {
  keys: "《吞噬星空》主角罗峰成为宇宙之主后，自称__？",
  answer: "银河领主"
};
const _0x54131a = {
  keys: "《春风十里，不如你》改编自冯唐的什么小说？",
  answer: "北京北京"
};
const _0x4bf75b = {
  keys: "《古董局中局》和《长安十二时辰》是同一人的作品吗？",
  answer: "是"
};
const _0x3340f8 = {
  keys: "穿到皇宫，你可以在皇后和贵妃之间选择一个身份，你应该",
  answer: "选贵妃，从宫斗剧看贵妃一定更受宠"
};
const _0x4a0b19 = {
  keys: "电影《晴雅集》中饰演饰演“公主”的演员是？",
  answer: "王子文"
};
const _0x428455 = {
  keys: "哪本书的主角是诸天万族的劫？",
  answer: "万族之劫"
};
const _0x534fc8 = {
  keys: "电视就《狼殿下》中肖战饰演了哪一个角色？",
  answer: "疾冲"
};
const _0x5a9e52 = {
  keys: "作者\"我吃西红柿”的作品《盘龙》中的盘龙指的是？",
  answer: "戒指"
};
const _0x277642 = {
  keys: "以下哪本书是宅猪的作品",
  answer: "帝尊"
};
const _0x3aa07a = {
  keys: "开启洪荒流的是哪位作者的哪本书？",
  answer: "梦入神机《佛本是道》"
};
const _0x4b5e95 = {
  keys: "以下哪个人物不是出自作家天下霸唱的作品？",
  answer: "王建国"
};
const _0x3fb679 = {
  keys: "电视剧《斗罗大陆》中饰演女主角小舞的明星是？",
  answer: "吴宣仪"
};
const _0x42ddfe = {
  keys: "《斗罗大陆》中为爱献祭的十万年魂兽是？",
  answer: "小舞"
};
const _0x122c9d = {
  keys: "《斗破苍穹》中萧炎在大千世界创建势力叫什么",
  answer: "无尽火域"
};
const _0x3b6a90 = {
  keys: "《春风十里，不如你》改编自冯唐的什么小说？",
  answer: "北京北京"
};
const _0x69f4e2 = {
  keys: "《古董局中局》和《长安十二时辰》是同一人的作品吗？",
  answer: "是"
};
const _0x12f7f2 = {
  keys: "《全球高武》主人公方平是哪界人？",
  answer: "人界"
};
const _0x2da611 = {
  keys: "《吞噬星空》的作者是谁？",
  answer: "我吃西红柿"
};
const _0x404aec = {
  keys: "《斗破苍穹》电视剧萧炎是谁扮演的？",
  answer: "吴磊"
};
const _0x5e4d3c = {
  keys: "《恶魔法则》的男主角叫什么",
  answer: "杜维"
};
const _0x2b15d3 = {
  keys: "郭敬明小说《悲伤逆流成河》于哪一年出版？",
  answer: "2007年"
};
const _0x230b21 = {
  keys: "影视剧《知否知否应是绿肥红瘦》故事发生的背景朝代是？",
  answer: "北宋"
};
const _0xc4219f = {
  keys: "《星辰变》的主角秦羽，有两个妖兽兄弟。是什么动物？",
  answer: "鹰和猿"
};
const _0x3da10e = {
  keys: "《龙族》中路明非与路鸣泽是？",
  answer: "兄弟"
};
const _0x73c2e3 = {
  keys: "赵丽颖在影视剧《知否知否应是绿肥红瘦》中饰演了哪一个角色？",
  answer: "盛明兰"
};
const _0x216e72 = {
  keys: "《全球高武》的作者是谁？",
  answer: "老鹰吃小鸡"
};
const _0x2b435b = {
  keys: "《美食供应商》中男主拥有什么系统？",
  answer: "厨神系统"
};
const _0x498ae2 = {
  keys: "以下哪位明星没有饰演过“夜华”这一角色？",
  answer: "王一博"
};
const _0x368d2b = {
  keys: "《无限恐怖》中，罗甘道是被什么杀死的？",
  answer: "航空母舰"
};
const _0x2dd556 = {
  keys: "《何以笙箫默》中男女主角分别是什么职业？",
  answer: "律师与摄影师"
};
const _0x14cb0d = {
  keys: "《灵域》作者是谁？",
  answer: "逆苍天"
};
const _0x2a4dd1 = {
  keys: "主角拥有绝世美颜、超凡气质，举手投足可引天地异象，简直主角模板，偏偏他的修炼天赋平平无奇。这本小说是",
  answer: "《平平无奇大师兄》"
};
const _0x4c1ca8 = {
  keys: "《史上最强炼气期》主角五千年一直停留在炼气期无法筑基，寿命却几乎无限。请问主角的炼气期大概修炼到了多少层？",
  answer: "练气八千层"
};
const _0x26c98e = {
  keys: "小说《三体》中罗辑提出的理论是？",
  answer: "黑暗森林理论"
};
const _0x4ac97b = {
  keys: "下列哪位男主角不是网游高手？",
  answer: "范闲"
};
const _0x4eb977 = {
  keys: "修真小说中以下哪个境界最高？",
  answer: "元婴期"
};
const _0x807568 = {
  keys: "《史上第一混乱》是反穿越的代表作之一，这本小说是哪里的人物穿越到现代发生的爆笑故事？",
  answer: "古代"
};
const _0x43b133 = {
  keys: "仙侠小说《大奉打更人》中，作者加入了悬疑探案类元素，十分吸引人。请问主角开场遇到的第一个案件是？",
  answer: "税银丢失案"
};
const _0x31aa9a = {
  keys: "《都市极品医神》的主角叫什么？",
  answer: "叶辰"
};
const _0x43c126 = {
  keys: "《遮天》中狠人大帝“不为成仙，只为红尘中等你归来。”，等待的是谁？",
  answer: "哥哥"
};
const _0x2cb880 = {
  keys: "《从零开始》更新了数年，近两千万字，才终于完结。请问从零开始更新了几年？",
  answer: "11年"
};
const _0x301835 = {
  keys: "小说中《鬼吹灯》摸金校尉祖师爷是谁？",
  answer: "曹操"
};
const _0x81e87c = {
  keys: "异能者不是人类而是一群猫，这样的世界是以下哪本小说？",
  answer: "《难道是我是神》"
};
const _0x5ddb72 = {
  keys: "修真小说中的“神识”以下哪个解释是对的？",
  answer: "精神方面的力量"
};
const _0xbd4136 = {
  keys: "“恐怖如斯”出自以下哪本书籍？",
  answer: "斗破苍穹"
};
const _0x3e5bd8 = {
  keys: "以下哪本男频小说是女作者完成？",
  answer: "《回到过去变成猫》陈词懒调"
};
const _0x1d081d = {
  keys: "请问女主女扮男装，男主怎么才可以知道她是个女孩子？",
  answer: "摸胸"
};
const _0x50755b = {
  keys: "影视剧《美人心计》中饰演窦漪房（杜云汐）的演员是？",
  answer: "林心如"
};
const _0xce126e = {
  keys: "在晋江纯爱文中，男主一般会有几位夫人？",
  answer: "男主没有夫人，只有男人"
};
const _0x368d61 = {
  keys: "由刘诗诗、倪妮主演的影视剧《流金岁月》改编自以下哪位作家的作品？",
  answer: "亦舒"
};
const _0x27b050 = {
  keys: "下列影视剧中，哪部是改编自网络小说？",
  answer: "极品家丁"
};
const _0x3c9e7e = {
  keys: "开启总裁文一脉的是以下哪本书？",
  answer: "《泡沫之夏》"
};
const _0x5b2ebd = {
  keys: "《我有一座冒险屋》中主角常用的武器是什么？",
  answer: "大锤"
};
const _0x4a14e2 = {
  keys: "下面三部作品，属于都市灵气复苏类爽文的神作是？",
  answer: "全球高武"
};
const _0x22cbe2 = {
  keys: "《灵域》作者是谁？",
  answer: "逆苍天"
};
const _0x125645 = {
  keys: "《没钱上大学的我只能去屠龙了》被许多读者称为近似《xx》原著的同人文!请问xx是哪部作品",
  answer: "龙族"
};
const _0x281460 = {
  keys: "以下哪本男频小说是女作者完成？",
  answer: "《回到过去变成猫》陈词懒调"
};
const _0x1e111b = {
  keys: "《凤囚凰》中容止将司马相如写给卓文君的情诗念给谁听？",
  answer: "楚玉"
};
const _0x47438d = {
  keys: "修真小说中的“神识”以下哪个解释是对的？",
  answer: "精神方面的力量"
};
const _0x319c91 = {
  keys: "“我儿王腾有大帝之资”这个梗出自哪本小说？",
  answer: "《遮天》"
};
const _0x3e5764 = {
  keys: "以下哪本网络小说2020年带火了一个流派？",
  answer: "诡秘之主"
};
const _0x3f2320 = {
  keys: "下列作品中，不是现实题材的是？",
  answer: "《最强狂兵》"
};
const _0x9271a = {
  keys: "《沙海》与《盗墓笔记》的关系是",
  answer: "后传"
};
const _0x441d0a = {
  keys: "马伯庸说《长安十二时辰》的脑洞原型来自什么",
  answer: "刺客信条"
};
const _0x98c3b9 = {
  keys: "以下不是南派三叔的作品的是？",
  answer: "《庆余年》"
};
const _0x560b84 = {
  keys: "在2016年出品的影视剧《我的前半生》中，袁泉饰演了哪一个角色？",
  answer: "唐晶"
};
const _0x26a77c = {
  keys: "一个靠着垂钓系统把自己钓出了“科技巨头”并拯救地球的小说是以下哪本？",
  answer: "《玩坏世界的垂钓者》"
};
const _0x557485 = {
  keys: "唐家三少的《生肖守护神》哪个属相是“老大”？",
  answer: "麒麟"
};
const _0x3b06ea = {
  keys: "《重生之将门毒后》一书中男主最喜欢怎么称呼女主？",
  answer: "沈娇娇"
};
const _0x44c3dc = {
  keys: "“老子的心情比烟花还要寂寞”出现在了猫腻的哪本小说中？",
  answer: "《间客》"
};
const _0x13304c = {
  keys: "《史上最强炼气期》主角五千年一直停留在炼气期无法筑基，寿命却几乎无限。请问主角的炼气期大概修炼到了多少层？",
  answer: "练气八千层"
};
const _0x56bc3b = {
  keys: "《修真聊天群》主角霸刀宋壹因为恐高，无法御刀而行，所以打算给自己的刀装上什么？",
  answer: "护栏"
};
const _0x1df570 = {
  keys: "主角穿越之后在天上飘了十几万年才下来的小说，是以下哪一本？",
  answer: "黎明之剑"
};
const _0x1488c6 = {
  keys: "以下哪个人物不是出自作家天下霸唱的作品？",
  answer: "王建国"
};
const _0x4e7540 = {
  keys: "《超神宠兽店》是近期值得一看的战宠文，这本书的作者还创作了知名黑暗文《黑暗王者》，请问作者是？",
  answer: "古羲"
};
const _0x4a524f = {
  keys: "以下谁是《雪中悍刀行》中的人物？",
  answer: "徐凤年"
};
const _0x2aab2c = {
  keys: "《帝霸》主角为了找丢失的__误入疯魔洞？",
  answer: "羊"
};
const _0x541df1 = {
  keys: "《万族之劫》火爆全网，这本书不仅好看，更新也十分给力，2020年12月，作者竟然更新了__字？",
  answer: "83万字"
};
const _0x34a50c = {
  keys: "一位道士在路边摆摊，面前放着三本秘籍，你认为最贵的功法是？",
  answer: "《五年高考三年模拟》"
};
const _0x1b3c4b = {
  keys: "《万族之劫》主角叫？",
  answer: "苏宇"
};
const _0x4257ef = {
  keys: "《无限恐怖》中，主角郑吒经历的第一个恐怖世界是？",
  answer: "生化危机"
};
const _0x2fba16 = {
  keys: "《遮天》的主角叫什么？",
  answer: "叶凡"
};
const _0x48168d = {
  keys: "《帝霸》主角为了找丢失的__误入疯魔洞？",
  answer: "羊"
};
const _0x2a800a = {
  keys: "《万族之劫》火爆全网，这本书不仅好看，更新也十分给力，2020年12月，作者竟然更新了__字？",
  answer: "83万字"
};
const _0xcf7fd3 = {
  keys: "一位道士在路边摆摊，面前放着三本秘籍，你认为最贵的功法是？",
  answer: "《五年高考三年模拟》"
};
const _0x518ccf = {
  keys: "《万族之劫》主角叫？",
  answer: "苏宇"
};
const _0x1fd1e1 = {
  keys: "《锦衣之下》女主袁今夏的职业是什么",
  answer: "捕快"
};
const _0x4b7ad6 = {
  keys: "《锦衣之下》原著作者是谁？",
  answer: "蓝色狮"
};
const _0x5d2365 = {
  keys: "《凡人修仙传》中主角被谁收为弟子",
  answer: "墨大夫"
};
const _0x570027 = {
  keys: "《凡人修仙传》中主角韩立家里排行老几？",
  answer: "老四"
};
const _0x2eb7ee = {
  keys: "2011年由于杨幂主演的影视剧《宫》，又名 ？",
  answer: "宫锁心玉"
};
const _0x4d11ea = {
  keys: "如果你穿越到古代成为一个庶女 \n你应该？",
  answer: "宅斗创业嫁入豪门"
};
const _0x40f9a7 = {
  keys: "由王凯主演的影视剧《清平乐》改编自以下哪部网文作品？",
  answer: "孤城闭"
};
const _0x57b003 = {
  keys: "路边看到一只纯黑色的小猫一直盯着你，你应该?",
  answer: "立马打包带走，回家洗洗就能变帅哥"
};
const _0x29d2fe = {
  keys: "电影《少年的你》拍摄地点在哪里？",
  answer: "重庆"
};
const _0x1f77b0 = {
  keys: "《斗破苍穹》中萧炎在大千世界创建势力叫什么",
  answer: "无尽火域"
};
const _0x282781 = {
  keys: "袁冰妍在影视剧《听雪楼》中，饰演了哪一个角色？",
  answer: "舒靖容"
};
const _0xdbd9b2 = {
  keys: "电影《晴雅集》中饰演博雅一角的演员是？",
  answer: "邓伦"
};
const _0x54efd9 = {
  keys: "《龙族》的主角是谁？",
  answer: "路明非"
};
const _0x4c70de = {
  keys: "请问女主女扮男装，男主怎么才可以知道她是个女孩子？",
  answer: "摸胸"
};
const _0x2fe541 = {
  keys: "网剧《三千鸦杀》中男主傅九云的真实身份是？",
  answer: "灵灯灯芯"
};
const _0x272261 = {
  keys: "《吞噬星空》的故事，发生在什么年代？",
  answer: "未来"
};
const _0xc3cf75 = {
  keys: "请问古代太医一把脉说的一句话是什么？",
  answer: "有喜了"
};
const _0x25f7f4 = {
  keys: "章子怡在影视剧《上阳赋》中饰演了哪一个角色？",
  answer: "王儇"
};
const _0x58e3b9 = {
  keys: "《长安十二时辰》中易烊千玺扮演的角色叫什么",
  answer: "李必"
};
const _0x41d73a = {
  keys: "《星辰变》的主角秦羽，有两个妖兽兄弟。是什么动物？",
  answer: "鹰和猿"
};
const _0x612caf = {
  keys: "唐家三少的《生肖守护神》哪个属相是“老大”？",
  answer: "麒麟"
};
const _0x2db6c2 = {
  keys: "《亏成首富从游戏开始》中主角公司有一个宅男每次都因为莫名其妙的原因而被奖励外出旅行，不是在旅行就是在去旅行的路上，这位宅男是",
  answer: "旅行者包旭"
};
const _0x3ed90f = {
  keys: "《斗破苍穹》纳兰嫣然为什么会和主角萧炎悔婚？",
  answer: "没有实力"
};
const _0x324b31 = {
  keys: "下列哪本小说的爱情故事没有经历多个轮回？",
  answer: "三生门"
};
const _0xb4e797 = {
  keys: "小说《全职高手》的游戏名字叫什么？",
  answer: "荣耀"
};
const _0x52a695 = {
  keys: "人不彪悍枉少年讲述的是热血少年花彪和谁的青春故事",
  answer: "飞车五人组"
};
const _0x4c83f4 = {
  keys: "网剧《我叫余欢水》改编自以下哪部小说？",
  answer: "如果没有明天"
};
const _0xf22c76 = {
  keys: "哪本书的主角最稳健？",
  answer: "我师兄实在是太稳健了"
};
const _0x14ce20 = {
  keys: "《传闻中的陈芊芊》中陈芊芊的青梅竹马是",
  answer: "裴恒"
};
const _0x501859 = {
  keys: "玄幻小说剧《斗罗大陆》中唐三与小舞初遇的地点是？",
  answer: "诺丁学院"
};
const _0x5cd37d = {
  keys: "以下哪本小说的故事没有发生在架空世界？",
  answer: "活着"
};
const _0x1d5c52 = {
  keys: "《开局签到荒古圣体》中的荒古圣体出自下列哪本小说？",
  answer: "遮天"
};
const _0x58b4f6 = {
  keys: "《鬼吹灯》小说情节“在墓的东南角点蜡烛”的原因是？",
  answer: "摸金校尉业内守则"
};
const _0x5730a1 = {
  keys: "网文小说作者尾鱼以写什么题材的小说出名？",
  answer: "惊悚文"
};
const _0x13420f = {
  keys: "以下哪位作者是女性？",
  answer: "陈词懒调"
};
const _0x270c1e = {
  keys: "《斗破苍穹》是哪一年开始在网上连载的？",
  answer: "2009年"
};
const _0x427ec2 = {
  keys: "下列哪个游戏是由小说改编而成？",
  answer: "诛仙"
};
const _0x133a2a = {
  keys: "下列哪部小说不属于“网络三大奇书”？",
  answer: "《斗破苍穹》"
};
const _0x484f8c = {
  keys: "《轮回乐园》作为一本长期霸榜的漫综无限流作品，即将突破1000万字。请问这本小说的作者是？",
  answer: "那一只蚊子"
};
const _0x54590d = {
  keys: "《大奉打更人》的作者是？",
  answer: "卖报小郎君"
};
const _0x2d4217 = {
  keys: "以下影视中哪部不属于由顾漫作品改编？",
  answer: "冰糖炖雪梨"
};
const _0x523ab3 = {
  keys: "杨幂在影视剧《美人心计》中饰演了哪个角色？",
  answer: "莫雪鸢"
};
const _0x5623fa = {
  keys: "下列哪一部片名里没有同时包含男女主人公的名字？",
  answer: "泡沫之夏"
};
const _0x2a49a7 = {
  keys: "《吞噬星空》的作者是谁？",
  answer: "我吃西红柿"
};
const _0x405d16 = {
  keys: "《盗墓笔记》的张起灵的别称叫什么",
  answer: "闷油瓶"
};
const _0x1caf77 = {
  keys: "《都市极品医神》的主角叫什么？",
  answer: "叶辰"
};
const _0x31d062 = {
  keys: "《遮天》中狠人大帝“不为成仙，只为红尘中等你归来。”，等待的是谁？",
  answer: "哥哥"
};
const _0xe4d433 = {
  keys: "《从零开始》更新了数年，近两千万字，才终于完结。请问从零开始更新了几年？",
  answer: "11年"
};
const _0x1abc70 = {
  keys: "以下哪本网络小说2020年带火了一个流派？",
  answer: "诡秘之主"
};
const _0x5fcb1b = {
  keys: "小说《赘婿》改编的电视剧男主角是？",
  answer: "郭麒麟"
};
const _0x3886ba = {
  keys: "影视剧《上阳赋》改编自以下哪位作者的小说？",
  answer: "寐语者"
};
const _0xfefc05 = {
  keys: "《悟空传》的作者叫什么",
  answer: "今何在"
};
const _0x18f7cd = {
  keys: "以下不是南派三叔的作品的是？",
  answer: "《庆余年》"
};
const _0x313687 = {
  keys: "由张杰演唱歌曲《剑心》是以下哪部电视剧的主题曲？",
  answer: "古剑奇谭"
};
const _0x5c647e = {
  keys: "《美食供应商》中男主拥有什么系统？",
  answer: "厨神系统"
};
const _0x5aa6d4 = {
  keys: "穿越到古代，不得不种田糊口，你应该？",
  answer: "翻箱倒柜，看能不能找到传家秘宝开启空间"
};
const _0x2d29be = {
  keys: "《掌中之物》的男主叫什么名字",
  answer: "傅慎行"
};
const _0x48c7d8 = {
  keys: "影视剧《三生三世十里桃花》中出现的成玉元君是以下哪部小说中的主人公？",
  answer: "三生三世步生莲"
};
const _0x4fb613 = {
  keys: "影视剧《香蜜沉沉烬如霜》中锦觅的母亲是？",
  answer: "花神"
};
const _0x4cc3dc = {
  keys: "《古董局中局》和《长安十二时辰》是同一人的作品吗？",
  answer: "是"
};
const _0x1e55ea = {
  keys: "《冠军之心》《胜者为王》《我们是冠军》这几本小说主要围绕哪种体育运动展开？",
  answer: "足球"
};
const _0x522971 = {
  keys: "网剧《我就是这般的女子》改编自以下哪位作者的小说作品？",
  answer: "月下蝶影"
};
const _0x45d1fd = {
  keys: "下列哪个游戏是由小说改编而成？",
  answer: "诛仙"
};
const _0x4b48bb = {
  keys: "影视剧《将夜》中，被称为“天下三痴之书痴”的角色是？",
  answer: "莫山山"
};
const _0xfbdc4b = {
  keys: "《间客》主角叫？",
  answer: "许乐"
};
const _0x50b518 = {
  keys: "女主突然呕吐，请问她怎么了？",
  answer: "吃多了"
};
const _0x4dd612 = {
  keys: "《一起来看流星雨》中饰演“楚雨荨”一角的演员是？",
  answer: "郑爽"
};
const _0x4eabe3 = {
  keys: "以下哪些演员没有饰演过吴邪？",
  answer: "杨洋"
};
const _0x5c84ed = {
  keys: "电视剧《下一站是幸福》于哪一年在湖南卫视首播？",
  answer: "2020年"
};
const _0x115b9f = {
  keys: "《一起来看流星雨》于哪一年在湖南卫视首播？",
  answer: "2009年"
};
const _0x29dc78 = {
  keys: "以下谁没有“坑神”之称？",
  answer: "叶良辰"
};
const _0x18f381 = {
  keys: "以男性为主角的苏文叫？",
  answer: "汤姆苏"
};
const _0x3ade56 = {
  keys: "旋风少女的原著作者是谁",
  answer: "明晓溪"
};
const _0x14d525 = {
  keys: "影视剧《有匪》中由赵丽颖饰演的角色是？",
  answer: "周翡"
};
const _0x3a9665 = {
  keys: "网剧《狐狸的夏天》改编自以下哪部网络小说？",
  answer: "当总裁恋爱时"
};
const _0xf49b73 = {
  keys: "《吞噬星空》的主角叫什么？",
  answer: "罗峰"
};
const _0x1ee6da = {
  keys: "下面哪个情节女主的手受伤几率比较低？",
  answer: "打架"
};
const _0x2b05b2 = {
  keys: "《恶魔法则》所在帝国叫什么帝国",
  answer: "罗兰帝国"
};
const _0x2bf73a = {
  keys: "以下哪部作品不是“清穿文三座大山”？",
  answer: "《我本闲凉》"
};
const _0x1181aa = {
  keys: "以下哪本小说中的主角没有开后宫？",
  answer: "万族之劫"
};
const _0x322491 = {
  keys: "电视剧《下一站是幸福》中饰演贺繁星的演员是？",
  answer: "宋茜"
};
const _0x3c204c = {
  keys: "你突然穿越到玄幻修真世界，开局一个废灵根，你应该？",
  answer: "暗自狂喜，主角人设已就位坐等飞升"
};
const _0x56832b = {
  keys: "《盘龙》书中的“盘龙”，是个什么器物？",
  answer: "戒指"
};
const _0x25e000 = {
  keys: "杨洋和迪丽热巴主演的影视剧《你是我的荣耀》原著作者是？",
  answer: "顾漫"
};
const _0x4ddeff = {
  keys: "一觉醒来你发现窗外丧尸横行，你应该？",
  answer: "睡个回笼觉，看看能觉醒什么异能"
};
const _0x1a0540 = {
  keys: "以下哪位女演员演过网文改编电视剧的男性角色？",
  answer: "张天爱"
};
const _0x18d888 = {
  keys: "以下哪个是小说《斗罗大陆》中奥斯卡制作恢复香肠的咒语？",
  answer: "老子有根大香肠"
};
const _0x114b9d = {
  keys: "下列哪本小说不是电竞言情小说?",
  answer: "冰糖炖雪梨"
};
const _0x3ad26e = {
  keys: "以下哪本小说故事背景没有发生在唐朝？",
  answer: "唐门贵女"
};
const _0xfc1701 = {
  keys: "《长安十二时辰》中张小敬的职位是什么？",
  answer: "不良人"
};
const _0xc6e0f3 = {
  keys: "电视剧《狼殿下》中王大陆饰演了哪一个角色？",
  answer: "楚有炆"
};
const _0x12e0e0 = {
  keys: "修真小说中不需要以下哪种气体修炼？",
  answer: "脚气"
};
const _0x183b68 = {
  keys: "下列哪个小说的主角没有动物朋友？",
  answer: "范闲"
};
const _0x220a69 = {
  keys: "《凡人修仙传》作者忘语最新力作《大梦主》正在火热连载，请问《大梦主》的主角叫什么",
  answer: "沈落"
};
const _0x137dd7 = {
  keys: "小说中“桀桀桀”是是什么意思？",
  answer: "笑声"
};
const _0xd7244f = {
  keys: "《斗破苍穹》中排名第三的异火叫什么？",
  answer: "净莲妖火"
};
const _0x29738f = {
  keys: "下班路上，突然有个受伤的人把你按在墙角，你应该？",
  answer: "满心欢喜，准备带他回家等待大佬的报恩"
};
const _0x348029 = {
  keys: "你在古玩街淘到一价值连城的青铜剑，正心情激动之际，手突然被其划伤，然后你可能会……",
  answer: "因破伤风住院"
};
const _0x3df381 = {
  keys: "以下三本神作，字数超过500万的是？",
  answer: "《万族之劫》"
};
const _0x5cb8fc = {
  keys: "《仙逆》是白金作者“耳根”的代表作之一 ，请问这部作品的主角是？",
  answer: "王林"
};
const _0x1563ec = {
  keys: "《清平乐》中公主徽柔与谁相爱？",
  answer: "太监"
};
const _0x19a82c = {
  keys: "《山海情》中实际发生地是哪里？",
  answer: "宁夏"
};
const _0x3a9579 = {
  keys: "请问什么情况老天会下大雨？",
  answer: "以上全部"
};
const _0xfac45 = {
  keys: "《我的徒弟都是大反派》中主角重生后成了魔道老祖，徒弟全是大反派，请问主角有几个徒弟？",
  answer: "9个"
};
const _0x11d093 = {
  keys: "以下哪本小说的女主角不是美食达人？",
  answer: "草莓印"
};
const _0x518f13 = {
  keys: "以下哪个小说中的女主角不是重生一世的？",
  answer: "神医嫡女"
};
const _0x3827be = {
  keys: "以下哪本小说不是网文作家鲜橙的作品？",
  answer: "表小姐"
};
const _0x43f39a = {
  keys: "“上交给国家”是哪部小说被影视化的梗？",
  answer: "《盗墓笔记》"
};
const _0x3940f7 = {
  keys: "被称为网络小说五大至高神作家是哪些？",
  answer: "东红，西豆，南机，北唐，中辰东"
};
const _0x4111bd = {
  keys: "《斗破苍穹》中第一个和萧炎在一起的女性角色是谁？",
  answer: "彩鳞（美杜莎）"
};
const _0x153e75 = {
  keys: "开辟的仙侠新潮流被称为“烂柯流”文的书是以下哪本？",
  answer: "《烂柯棋缘》"
};
const _0x277539 = {
  keys: "以下哪本小说有老爷爷类型的金手指？",
  answer: "《盘龙》"
};
const _0x137fbb = {
  keys: "《诛仙》的作者是？",
  answer: "萧鼎"
};
const _0xbbaaa = {
  keys: "主角获得亏钱系统，亏钱等于赚钱。但主角想赔钱，却总是赔不了的小说是?",
  answer: "《亏成首富从游戏开始》"
};
const _0x379a93 = {
  keys: "《回到明朝当王爷》因为是几世善人而被地府转世到了古代？",
  answer: "九世"
};
const _0x391dd9 = {
  keys: "主角为了保护地球，独自与宇宙巨兽战斗，绝望之际夺舍了巨兽的身体，获得了吞噬万物的天赋，这本小说是？",
  answer: "《吞噬星空》"
};
const _0x13e039 = {
  keys: "《生活系游戏》是一部非常促进食欲的美食文，其中描写了非常多的奇妙美食，令人回味无穷。主角最擅长做的是？",
  answer: "八宝粥"
};
const _0x5c354f = {
  keys: "《三体》中是谁劫持一搜太空舰逃离为人类保存文明火种",
  answer: "章北海"
};
const _0x14e649 = {
  keys: "“如果世界上曾经有那个人出现过，其他人都会变成将就，而我不愿意将就。”这句话出自哪本小说？",
  answer: "何以笙箫默"
};
const _0x576822 = {
  keys: "《灵域》男主角秦烈电视剧扮演者是谁？",
  answer: "范丞丞"
};
const _0xc1cf8 = {
  keys: "《大秦赋》中嬴政的扮演者是谁？",
  answer: "张鲁一"
};
const _0x5a7278 = {
  keys: "以下哪位演员没演过网文改编的电视剧？",
  answer: "葛优"
};
const _0xc30bb0 = {
  keys: "胎穿到古代成为皇子之一，你应该？",
  answer: "卖萌装傻，争取安全长大做个闲散王爷"
};
const _0x3838ee = {
  keys: "《无限恐怖》的主角叫什么？",
  answer: "郑吒"
};
const _0x18107f = {
  keys: "把流眼泪形容成兰州拉面的是哪位作者？",
  answer: "紫金陈"
};
const _0x4270bd = {
  keys: "《万族之劫》火爆全网，这本书不仅好看，更新也十分给力，以下不属于书中的势力是",
  answer: "大河府"
};
const _0x1062e6 = {
  keys: "主角的金手指是吃饭等于吃补药，开创“饭桶流派”的小说是哪本？",
  answer: "《从大佬到武林盟主》"
};
const _0x87f8bf = {
  keys: "电视剧《古剑奇谭》中风晴雪的身份是？",
  answer: "幽都灵女"
};
const _0x2f9f63 = {
  keys: "《盗墓笔记》的主角叫什么",
  answer: "吴邪"
};
const _0x9adf33 = {
  keys: "《龙族》陈墨瞳的小名叫什么",
  answer: "诺诺"
};
const _0x1b2910 = {
  keys: "庆余年武力值最高的是谁？",
  answer: "五竹"
};
const _0x613e78 = {
  keys: "开启盗墓一脉的是以下哪本书？",
  answer: "《鬼吹灯》"
};
const _0x393f1f = {
  keys: "当你看到小区里有只猫在遛狗不要惊讶，因为它可能是重生者，这情景会出现在哪本书？",
  answer: "《回到过去变成猫》"
};
const _0x354d24 = {
  keys: "《大王饶命》主角吕树的妹妹叫什么？",
  answer: "吕小鱼"
};
const _0x54570c = {
  keys: "张碧晨演唱歌曲《年轮》是以下哪部电视剧的插曲？",
  answer: "花千骨"
};
const _0x5ccee7 = {
  keys: "《山海情》男主角马得福的扮演者是谁？",
  answer: "黄轩"
};
const _0x37d566 = {
  keys: "电视剧《下一站是幸福》中饰演元宋的演员是？",
  answer: "宋威龙"
};
const _0x136fba = {
  keys: "《剑来》是谁写的小说？",
  answer: "烽火戏诸侯"
};
const _0x447009 = {
  keys: "《斗破苍穹》主角叫什么名字",
  answer: "萧炎"
};
const _0x529bf5 = {
  keys: "郭珍霓在影视剧《华胥引》中一人分饰了几个角色？",
  answer: "2"
};
const _0x22e819 = {
  keys: "以下哪部是由大ip小说改编的电视剧？",
  answer: "长安十二时辰"
};
const _0x57a4a6 = {
  keys: "穿越到末世文，发现男主黑化要毁灭世界，你应该？",
  answer: "找到女主，撮合恋情就能拯救世界"
};
const _0xa62087 = {
  keys: "口头禅“我还有机会吗”的张东升老师，是教什么的？",
  answer: "数学"
};
const _0xd6d212 = {
  keys: "《我的绝色美女房客》中开光镜用的丹药名是？",
  answer: "血玉丹"
};
const _0x498e57 = {
  keys: "以下哪位明星没有饰演过“白浅”这一角色？",
  answer: "李一桐"
};
const _0x3a6519 = {
  keys: "由李易峰主演的影视剧《镜·双城》原著作者是？",
  answer: "沧月"
};
const _0xce556f = {
  keys: "《锦衣之下》发生在什么朝代",
  answer: "明"
};
const _0x38d50b = {
  keys: "“时代姐妹花”是以下哪部电影中的主角团体？",
  answer: "小时代"
};
const _0x5416df = {
  keys: "《鬼吹灯》的主角叫什么名字",
  answer: "胡八一"
};
const _0xf5f2c8 = {
  keys: "《诛仙》中，作者引用了道德经中的一句话：“天地不仁，以万物为__！”",
  answer: "刍狗"
};
const _0x4c7bf6 = {
  keys: "《诛仙》的主角叫什么名字",
  answer: "张小凡"
};
const _0x46674b = {
  keys: "以下哪本的男主不是影帝？",
  answer: "《全娱乐圈等我C位出道》"
};
const _0xc8e8c5 = {
  keys: "刘诗诗在影视剧《流金岁月》中饰演了哪一个角色？",
  answer: "蒋南孙"
};
const _0x423770 = {
  keys: "周冬雨在电影《少年的你》中饰演了哪一个角色？",
  answer: "陈念"
};
const _0xa38d32 = {
  keys: "《传闻中的陈芊芊》里男主角的名字叫什么？",
  answer: "韩烁"
};
const _0x41ecc3 = {
  keys: "《间客》作者是谁",
  answer: "猫腻"
};
const _0x45732c = {
  keys: "网文改编剧《三千鸦杀》的原著作者是？",
  answer: "十四郎"
};
const _0x5f423c = {
  keys: "《诡秘之主》中星之海盗团的统领是谁？",
  answer: "嘉德丽雅"
};
const _0x4fcad0 = {
  keys: "以下哪部影视剧的原著小说有“清穿三座大山”的美誉？",
  answer: "步步惊心"
};
const _0x2b4fdb = {
  keys: "《山海情》李水花的扮演者是谁？",
  answer: "热依扎"
};
const _0x995b68 = {
  keys: "电影版《三生三世十里桃花》饰演男主角夜华的明星是？",
  answer: "杨洋"
};
const _0x55ffd8 = {
  keys: "《吞噬星空》主角叫什么？",
  answer: "罗峰"
};
const _0xa95222 = {
  keys: "去爬山突然失足，你应该？",
  answer: "沉着冷静，等待穿越"
};
const _0x41438e = {
  keys: "《从前有座灵剑山》的男主人公扮演者叫什么",
  answer: "许凯"
};
const _0x108b36 = {
  keys: "微微一笑很倾城女主叫什么",
  answer: "贝微微"
};
const _0x37f533 = {
  keys: "如果你穿越到小说中成了一名反派，你应该？",
  answer: "逃离人设，暗中抱紧主角大腿"
};
const _0x52e837 = {
  keys: "《鬼吹灯》中盗墓者的别称叫什么",
  answer: "摸金校尉"
};
const _0x5a1c59 = {
  keys: "《如懿传》是发生在哪个皇帝时期的事情",
  answer: "乾隆"
};
const _0x2a2200 = {
  keys: "《庆余年》电视剧中，郭麒麟所扮演的角色叫什么？",
  answer: "范思辙"
};
const _0xece9d4 = {
  keys: "在古装剧中，下面几个人的人设是什么样子的？公主、闺秀、秀才",
  answer: "刁蛮、病弱、不要命"
};
const _0x282b5a = {
  keys: "《庆余年》中五竹眼睛总是蒙着一条黑布，令人感觉深不可测，那他的真实身份是什么？",
  answer: "上古文明的高科技机器人"
};
const _0x1faa61 = {
  keys: "网剧《狐狸的夏天》的女主角是谁？",
  answer: "谭松韵"
};
const _0x3119cd = {
  keys: "《斗罗大陆》的作者是谁？",
  answer: "唐家三少"
};
const _0x1782de = {
  keys: "《古董局中局》的作者是谁？",
  answer: "马伯庸"
};
const _0x273508 = {
  keys: "《隐秘的角落》主角叫什么名字",
  answer: "朱朝阳"
};
const _0x163e4b = {
  keys: "影视剧《知否知否应是绿肥红瘦》改编自以下哪位作者的同名小说？",
  answer: "关心则乱"
};
const _0x3e8008 = {
  keys: "任何人可以在这里买到想要的任何东西，金钱、寿命、容颜，只要付出足够的代价。……这句话是以下哪本小说的设定？",
  answer: "《特拉福买家俱乐部》"
};
const _0x363698 = {
  keys: "影视剧《大江大河》中饰演“宋运辉”的演员是？",
  answer: "王凯"
};
const _0x2b00de = {
  keys: "《诛仙》主角的师傅，大竹峰首座是谁？",
  answer: "田不易"
};
const _0x368515 = {
  keys: "王丽坤在影视剧《美人心计》中一人分饰了几个角色？",
  answer: "2"
};
const _0x191438 = {
  keys: "《龙族》的作者是？",
  answer: "江南"
};
const _0x2d5021 = {
  keys: "历史上被公认为我国第一本网络小说是以下哪一部？",
  answer: "《第一次亲密接触》"
};
const _0x322b69 = {
  keys: "电视剧《狼殿下》中李沁饰演了哪一个角色？",
  answer: "马摘星"
};
const _0x306367 = {
  keys: "影视剧《三生三世十里桃花》的原著作者是谁？",
  answer: "唐七"
};
const _0x156f0a = {
  keys: "琅琊榜中梅长苏的原名叫什么",
  answer: "林殊"
};
const _0x2db278 = {
  keys: "《明日之劫》《难道我是神》《旧日之箓》是哪位大神作者的作品？",
  answer: "熊狼狗"
};
const _0x43dff4 = {
  keys: "《斗破苍穹》中，萧炎上了几次云岚宗。",
  answer: "3"
};
const _0x386e1d = {
  keys: "以下哪部影视剧不属于由言情作家十四郎的作品改编？",
  answer: "《人民的名义》"
};
const _0x1ba89c = {
  keys: "网络剧《最好的我们》改编自以下哪位作者的同名小说？",
  answer: "八月长安"
};
const _0x546544 = {
  keys: "《诡秘之主》中愚者先生的小号是",
  answer: "世界"
};
const _0x408367 = {
  keys: "掌中之物改名电视剧叫什么",
  answer: "阳光之下"
};
const _0x4c6468 = {
  keys: "《斗罗大陆》的男主角叫什么？",
  answer: "唐三"
};
const _0x52a38b = {
  keys: "影视剧《将夜》中，被称为“天下三痴之道痴”的角色是？",
  answer: "叶红鱼"
};
const _0x1e7b73 = {
  keys: "《且试天下》是以下哪位作家的作品？",
  answer: "倾泠月"
};
const _0x13a474 = {
  keys: "在总裁文中，女主怀孕一胎最多会生几个孩子？",
  answer: "一胎10宝"
};
const _0x1408cb = {
  keys: "秦俊杰在影视剧《听雪楼》中，饰演了哪一个角色？",
  answer: "萧忆情"
};
const _0x2907b3 = {
  keys: "电视剧《古剑奇谭》中百里屠苏的原名叫什么？",
  answer: "韩云溪"
};
const _0x17dc7a = {
  keys: "主角建立了一个组织，叫“炸天帮”。号称有百万帮众，然而帮里的所有人都是主角自己扮演的，这本小说是？",
  answer: "《最强反套路系统》"
};
const _0x50ac29 = {
  keys: "影视剧《华胥引》中饰演“宋凝”的演员是？",
  answer: "蒋欣"
};
const _0x139caa = {
  keys: "穿成总裁文中总裁的白月光，你应该？",
  answer: "远离总裁，以防成为女主炮灰"
};
const _0x33ef48 = {
  keys: "开启修仙流的是哪位作者的哪本书？",
  answer: "萧潜 《飘渺之旅》"
};
const _0x353856 = {
  keys: "《全职高手》中叶修在新开的第十区首杀？",
  answer: "暗夜猫妖"
};
const _0x2e3a9e = {
  keys: "《斗罗大陆》的主角唐三，穿越前是哪个门派的外门弟子。",
  answer: "唐门"
};
const _0x1dad35 = {
  keys: "以下哪本不是总裁文？",
  answer: "《才不要和老板谈恋爱》"
};
let _0x241056 = [_0x9469df, _0x1aca8e, _0x17f6d2, _0x215773, _0x3b6407, _0x2c18cc, _0x59e9d9, _0x1c6840, _0x51253c, _0x281f15, _0x29c21f, _0x44b9b7, _0x58a361, _0x3b9c40, _0x3a436a, _0x2fca0, _0x1b4969, _0x15735b, _0x5b6ad3, _0x53913b, _0x15dc7f, _0x3c677d, _0x35a0bc, _0x25bfea, _0x4bc6f2, _0x53f29f, _0x34ef24, _0x23b33e, _0x5d8c7e, _0x183de3, _0x465036, _0x5e2638, _0x269523, _0x4de943, _0x14d605, _0x31c25e, _0x39d09b, _0x4ea6f4, _0x1acc6e, _0x13a032, _0x102748, _0x3e7e49, _0x254609, _0x4e8a4f, _0x53a2a4, _0x5364ee, _0x502fe5, _0x46f2c1, _0x22c841, _0xeb762, _0x49d16d, _0x3c59bc, _0x47c584, _0x2ab601, _0x39f5ec, _0x2ebe82, _0x3d84f9, _0x5c0794, _0x4cbc94, _0x2eda31, _0x24b8f0, _0x566dc0, _0x27dd09, _0x20714f, _0x515b84, _0x50db72, _0x29bdb2, _0x5d5cee, _0x432e6f, _0x519c1a, _0x54e752, _0x41e950, _0x474dc9, _0x367631, _0x1508f9, _0x160fc6, _0x2f61e5, _0x2381af, _0x23dd7f, _0x265166, _0x39ec7c, _0x1ad72d, _0x2ff681, _0x39f4a1, _0x4f598b, _0x5d58f7, _0x1b3144, _0x60a879, _0x47ac45, _0x3c2fb3, _0x2423e7, _0x227b5c, _0xa5022b, _0x2cf847, _0xfc5cf2, _0x4c3e27, _0x418618, _0xa6e5b3, _0x3334d5, _0x1c459f, _0x586b27, _0x403a84, _0x5a410a, _0x59485c, _0x1e7cc4, _0x5107e5, _0x5e60b5, _0x4a8956, _0x3a5f6c, _0x279dff, _0x3108eb, _0xb7aa51, _0x324150, _0x2081fb, _0x1d2958, _0x3a89c7, _0x972847, _0x4aab2f, _0x4e0237, _0xa5a859, _0x23a758, _0x235d9c, _0x5d4b5d, _0xa3ca12, _0x51be71, _0x2c2c46, _0x48348a, _0x3aa452, _0xa96d6d, _0xfb86ef, _0x54ccaf, _0x2385a2, _0x456595, _0x1eae33, _0x18509a, _0x3efd77, _0x2960e8, _0x33d19f, _0x30f613, _0x4b9d79, _0xc628f9, _0x191876, _0xb409f6, _0x374def, _0x21fdfb, _0x4da761, _0x4ed970, _0x126637, _0x3eb21b, _0x2ecf8c, _0x379c84, _0x230c58, _0x9717a1, _0x35112c, _0x28ba93, _0x2b1945, _0x3cec5c, _0x26602f, _0x5ac155, _0x19d5b4, _0x472fc7, _0x4db62e, _0x398bc4, _0x2cf39b, _0x1521ad, _0x4e43e9, _0x5c3097, _0x4a1ec0, _0x214f83, _0x340941, _0x305f88, _0xb808f9, _0x14d62c, _0x1b19c5, _0x5b7d38, _0x4b3590, _0x32a93c, _0x316b83, _0x33bb6e, _0x415ad6, _0x15595a, _0x12e9a3, _0x47dcc0, _0x4c5469, _0x5c20c1, _0x36424a, _0x227b90, _0x14b4da, _0x5a58ff, _0x3e062a, _0x37c71f, _0x42959e, _0x5d5ec7, _0x5eb4a4, _0x5655de, _0x437b10, _0x3a6531, _0x2a4999, _0x4add85, _0x1703c4, _0x1a8a1d, _0x57ba55, _0x5f5976, _0xadebaf, _0x1720d7, _0x3f176f, _0xe3d1fd, _0xbc4bc9, _0x54a355, _0x288d0a, _0x54131a, _0x4bf75b, _0x3340f8, _0x4a0b19, _0x428455, _0x534fc8, _0x5a9e52, _0x277642, _0x3aa07a, _0x4b5e95, _0x3fb679, _0x42ddfe, _0x122c9d, _0x3b6a90, _0x69f4e2, _0x12f7f2, _0x2da611, _0x404aec, _0x5e4d3c, _0x2b15d3, _0x230b21, _0xc4219f, _0x3da10e, _0x73c2e3, _0x216e72, _0x2b435b, _0x498ae2, _0x368d2b, _0x2dd556, _0x14cb0d, _0x2a4dd1, _0x4c1ca8, _0x26c98e, _0x4ac97b, _0x4eb977, _0x807568, _0x43b133, _0x31aa9a, _0x43c126, _0x2cb880, _0x301835, _0x81e87c, _0x5ddb72, _0xbd4136, _0x3e5bd8, _0x1d081d, _0x50755b, _0xce126e, _0x368d61, _0x27b050, _0x3c9e7e, _0x5b2ebd, _0x4a14e2, _0x22cbe2, _0x125645, _0x281460, _0x1e111b, _0x47438d, _0x319c91, _0x3e5764, _0x3f2320, _0x9271a, _0x441d0a, _0x98c3b9, _0x560b84, _0x26a77c, _0x557485, _0x3b06ea, _0x44c3dc, _0x13304c, _0x56bc3b, _0x1df570, _0x1488c6, _0x4e7540, _0x4a524f, _0x2aab2c, _0x541df1, _0x34a50c, _0x1b3c4b, _0x4257ef, _0x2fba16, _0x48168d, _0x2a800a, _0xcf7fd3, _0x518ccf, _0x1fd1e1, _0x4b7ad6, _0x5d2365, _0x570027, _0x2eb7ee, _0x4d11ea, _0x40f9a7, _0x57b003, _0x29d2fe, _0x1f77b0, _0x282781, _0xdbd9b2, _0x54efd9, _0x4c70de, _0x2fe541, _0x272261, _0xc3cf75, _0x25f7f4, _0x58e3b9, _0x41d73a, _0x612caf, _0x2db6c2, _0x3ed90f, _0x324b31, _0xb4e797, _0x52a695, _0x4c83f4, _0xf22c76, _0x14ce20, _0x501859, _0x5cd37d, _0x1d5c52, _0x58b4f6, _0x5730a1, _0x13420f, _0x270c1e, _0x427ec2, _0x133a2a, _0x484f8c, _0x54590d, _0x2d4217, _0x523ab3, _0x5623fa, _0x2a49a7, _0x405d16, _0x1caf77, _0x31d062, _0xe4d433, _0x1abc70, _0x5fcb1b, _0x3886ba, _0xfefc05, _0x18f7cd, _0x313687, _0x5c647e, _0x5aa6d4, _0x2d29be, _0x48c7d8, _0x4fb613, _0x4cc3dc, _0x1e55ea, _0x522971, _0x45d1fd, _0x4b48bb, _0xfbdc4b, _0x50b518, _0x4dd612, _0x4eabe3, _0x5c84ed, _0x115b9f, _0x29dc78, _0x18f381, _0x3ade56, _0x14d525, _0x3a9665, _0xf49b73, _0x1ee6da, _0x2b05b2, _0x2bf73a, _0x1181aa, _0x322491, _0x3c204c, _0x56832b, _0x25e000, _0x4ddeff, _0x1a0540, _0x18d888, _0x114b9d, _0x3ad26e, _0xfc1701, _0xc6e0f3, _0x12e0e0, _0x183b68, _0x220a69, _0x137dd7, _0xd7244f, _0x29738f, _0x348029, _0x3df381, _0x5cb8fc, _0x1563ec, _0x19a82c, _0x3a9579, _0xfac45, _0x11d093, _0x518f13, _0x3827be, _0x43f39a, _0x3940f7, _0x4111bd, _0x153e75, _0x277539, _0x137fbb, _0xbbaaa, _0x379a93, _0x391dd9, _0x13e039, _0x5c354f, _0x14e649, _0x576822, _0xc1cf8, _0x5a7278, _0xc30bb0, _0x3838ee, _0x18107f, _0x4270bd, _0x1062e6, _0x87f8bf, _0x2f9f63, _0x9adf33, _0x1b2910, _0x613e78, _0x393f1f, _0x354d24, _0x54570c, _0x5ccee7, _0x37d566, _0x136fba, _0x447009, _0x529bf5, _0x22e819, _0x57a4a6, _0xa62087, _0xd6d212, _0x498e57, _0x3a6519, _0xce556f, _0x38d50b, _0x5416df, _0xf5f2c8, _0x4c7bf6, _0x46674b, _0xc8e8c5, _0x423770, _0xa38d32, _0x41ecc3, _0x45732c, _0x5f423c, _0x4fcad0, _0x2b4fdb, _0x995b68, _0x55ffd8, _0xa95222, _0x41438e, _0x108b36, _0x37f533, _0x52e837, _0x5a1c59, _0x2a2200, _0xece9d4, _0x282b5a, _0x1faa61, _0x3119cd, _0x1782de, _0x273508, _0x163e4b, _0x3e8008, _0x363698, _0x2b00de, _0x368515, _0x191438, _0x2d5021, _0x322b69, _0x306367, _0x156f0a, _0x2db278, _0x43dff4, _0x386e1d, _0x1ba89c, _0x546544, _0x408367, _0x4c6468, _0x52a38b, _0x1e7b73, _0x13a474, _0x1408cb, _0x2907b3, _0x17dc7a, _0x50ac29, _0x139caa, _0x33ef48, _0x353856, _0x2e3a9e, _0x1dad35];
class _0xa7fade {
  constructor(_0x279d2d) {
    this.index = ++_0x35990f;
    this.name = this.index;
    this.valid = false;
    this.token = _0x279d2d;
    this.deviceId = "ykvgkzoyixnrrftwzwwxibnersiemhyjyqsamwptgr" + Math.floor(Date.now() / 1000).toString();
    this.taskList = [];
  }
  async getUserProfile() {
    try {
      let _0x3fd9ad = "https://goldcoinnew.zhuishushenqi.com/account/profile?token=" + this.token + "&channel=APST&b-zssq=zssq",
        _0x4a1b53 = "",
        _0x1aaaa6 = _0x11505b(_0x3fd9ad, this.deviceId, _0x4a1b53);
      await _0x5d8af2("get", _0x1aaaa6);
      let _0x2d0466 = _0x2d24b1;
      if (!_0x2d0466) {
        return;
      }
      if (_0x2d0466.ecode == 0) {
        this.valid = true;
        this.name = _0x2d0466.data.nickname;
        this.gold = _0x2d0466.data.gold;
        this.balance = _0x2d0466.data.balance;
        console.log("昵称：" + this.name);
        console.log("余额：" + this.gold + "金币 ≈ " + this.balance + "元");
        console.log("等级：" + _0x2d0466.data.level + " (经验 " + (_0x2d0466.data.exp - _0x2d0466.data.levelExp) + "/" + (_0x2d0466.data.nextExp - _0x2d0466.data.levelExp) + ")");
      } else {
        console.log("查询账户失败: " + _0x2d0466.message);
      }
    } catch (_0x24010f) {
      console.log(_0x24010f);
    } finally {}
  }
  async judgeSignIn() {
    try {
      let _0xceb62a = "https://api.zhuishushenqi.com/user/v2/judgeSignIn?isNew=true&token=" + this.token + "&b-zssq=zssq",
        _0x31ae71 = "",
        _0x536167 = _0x11505b(_0xceb62a, this.deviceId, _0x31ae71);
      await _0x5d8af2("get", _0x536167);
      let _0x223002 = _0x2d24b1;
      if (!_0x223002) {
        return;
      }
      _0x223002.ok == true ? (console.log("今天" + (_0x223002.type == 0 ? "已" : "未") + "签到，已签到" + _0x223002.days + "天"), _0x223002.type && (await this.signIn(_0x223002.activityId))) : console.log("查询签到情况失败: " + _0x223002.code);
    } catch (_0x508a5a) {
      console.log(_0x508a5a);
    } finally {}
  }
  async signIn(_0x4d2533) {
    try {
      let _0x515a48 = "https://api.zhuishushenqi.com/user/signIn?isNew=true&token=" + this.token + "&activityId=" + _0x4d2533 + "&version=2&type=2&b-zssq=zssq",
        _0x356b1b = "",
        _0x379e81 = _0x11505b(_0x515a48, this.deviceId, _0x356b1b);
      await _0x5d8af2("get", _0x379e81);
      let _0x502da2 = _0x2d24b1;
      if (!_0x502da2) {
        return;
      }
      _0x502da2.ok == true ? console.log("签到成功，获得" + _0x502da2.gold + "金币") : console.log("签到失败: " + _0x502da2.code);
    } catch (_0x195a34) {
      console.log(_0x195a34);
    } finally {}
  }
  async getTaskList() {
    try {
      let _0xf82d49 = "http://goldcoinnew.zhuishushenqi.com/redPacket/tasks?taskVersion=4001&token=" + this.token + "&version=4.45.0",
        _0x4d0e20 = "",
        _0x46b13c = _0x11505b(_0xf82d49, this.deviceId, _0x4d0e20);
      await _0x5d8af2("get", _0x46b13c);
      let _0x5becd2 = _0x2d24b1;
      if (!_0x5becd2) {
        return;
      }
      if (_0x5becd2.ecode == 0) {
        for (let _0x324171 of _0x5becd2.data) {
          console.log(_0x324171.title + " " + _0x324171.completed + "/" + _0x324171.times + " -- " + (_0x324171.taskStatus ? "已" : "未") + "完成");
          if (!_0x324171.taskStatus) {
            if (!(_0x324171.action == "rw-incentive-video")) {
              if (!(_0x324171.action == "rw-purchase")) {
                if (!(_0x324171.action == "rw-daily-question")) {
                  if (!(_0x324171.action == "rw-total-read")) {
                    if (!(_0x324171.action.indexOf("rw-read") > -1)) {
                      this.taskList.push(_0x324171);
                    }
                  }
                }
              }
            }
          }
        }
      } else {
        console.log("查询任务列表失败: " + _0x5becd2.message);
      }
    } catch (_0x45c58) {
      console.log(_0x45c58);
    } finally {}
  }
  async completeTask(_0x5d2355) {
    try {
      let _0x350ed1 = "goldTask";
      for (let _0xb72dd7 of _0x5d2355.position) {
        _0x350ed1 = _0xb72dd7.position;
      }
      let _0x3dc91f = "http://goldcoinnew.zhuishushenqi.com/redPacket/completeTask?token=" + this.token,
        _0x44abe9 = "{\"version\":\"4.45.0\",\"action\":\"" + _0x5d2355.action + "\",\"channel\":\"APST\",\"taskVersion\":" + _0x5d2355.taskVersion + ",\"position\":\"" + _0x350ed1 + "\"}",
        _0x1fd2ae = _0x11505b(_0x3dc91f, this.deviceId, _0x44abe9);
      await _0x5d8af2("post", _0x1fd2ae);
      let _0x150f77 = _0x2d24b1;
      if (!_0x150f77) {
        return;
      }
      if (_0x150f77.ecode == 0) {
        let _0x4dbdfa = [];
        for (let _0x46bb78 in _0x150f77.data) {
          _0x4dbdfa.push(_0x150f77.data[_0x46bb78].rewardText);
        }
        console.log("完成任务[" + _0x5d2355.title + "]获得" + _0x4dbdfa.join("，"));
      } else {
        console.log("完成任务[" + _0x5d2355.title + "]失败: " + _0x150f77.message);
      }
    } catch (_0x2bbb94) {
      console.log(_0x2bbb94);
    } finally {}
  }
  async incentiveVideo(_0x3d0921) {
    try {
      let _0x52c959 = "http://goldcoinnew.zhuishushenqi.com/redPacket/incentiveVideo?token=" + this.token + "&b-zssq=" + _0x58a4f7.encode(this.deviceId),
        _0x5ad584 = "{\"data\":\"a7KlUX+09Sgkx3sPFPuHhoP9H5i02H9hjhuJhr7yY8ffaifx5FIhOIO\\/Wh67UR8s\\r\\nJwbWUjOPH6A2he82NF0ZpA==\",\"version\":\"4.45.0\",\"action\":\"" + _0x3d0921.action + "\",\"channel\":\"APST\",\"position\":\"\",\"taskVersion\":" + _0x3d0921.taskVersion + "}",
        _0x310f50 = _0x11505b(_0x52c959, this.deviceId, _0x5ad584);
      await _0x5d8af2("post", _0x310f50);
      let _0x21449e = _0x2d24b1;
      if (!_0x21449e) {
        return;
      }
      if (_0x21449e.ecode == 0) {
        let _0x59a138 = [];
        for (let _0x40f306 in _0x21449e.data) {
          _0x59a138.push(_0x21449e.data[_0x40f306].rewardText);
        }
        console.log("完成任务[" + _0x3d0921.title + "]获得" + _0x59a138.join("，"));
      } else {
        console.log("完成任务[" + _0x3d0921.title + "]失败: " + _0x21449e.message);
      }
    } catch (_0x4262f9) {
      console.log(_0x4262f9);
    } finally {}
  }
  async getActiveRaffle() {
    try {
      let _0x332302 = "https://goldcoin.zhuishushenqi.com/raffle/getActiveRaffle?token=" + this.token,
        _0x49cb4e = "",
        _0x20aa66 = _0x11505b(_0x332302, this.deviceId, _0x49cb4e);
      await _0x5d8af2("get", _0x20aa66);
      let _0x430ed7 = _0x2d24b1;
      if (!_0x430ed7) {
        return;
      }
      _0x430ed7.ok == true ? (this.raffleId = _0x430ed7.data.raffle._id, await this.doDraw()) : console.log("查询抽奖情况失败: " + _0x430ed7.message);
    } catch (_0x19f5fe) {
      console.log(_0x19f5fe);
    } finally {}
  }
  async doDraw() {
    try {
      let _0x11dc33 = "http://goldcoin.zhuishushenqi.com/raffle/doDraw",
        _0x27f1fc = "{\"isGold\":true,\"raffleId\":\"" + this.raffleId + "\",\"token\":\"" + this.token + "\"}",
        _0x1dbd84 = _0x11505b(_0x11dc33, this.deviceId, _0x27f1fc);
      await _0x5d8af2("post", _0x1dbd84);
      let _0x3b52d7 = _0x2d24b1;
      if (!_0x3b52d7) {
        return;
      }
      _0x3b52d7.ok == true ? console.log("抽奖获得" + _0x3b52d7.data.prize.name) : console.log("抽奖失败: " + _0x3b52d7.message);
    } catch (_0x5709e1) {
      console.log(_0x5709e1);
    } finally {}
  }
  async getCountdownGold(_0x55603a) {
    try {
      let _0x49abc9 = "https://goldcoin.zhuishushenqi.com/activity/getCountdownGold?token=" + this.token + "&adType=" + _0x55603a + "&b-zssq=zssq",
        _0x14931b = "",
        _0x7136b3 = _0x11505b(_0x49abc9, this.deviceId, _0x14931b);
      await _0x5d8af2("get", _0x7136b3);
      let _0x1b3a7b = _0x2d24b1;
      if (!_0x1b3a7b) {
        return;
      }
      if (_0x1b3a7b.code == 0) {
        if (_0x1b3a7b.data.status == 2) {
          console.log("可领取时段红包[" + _0x55603a + "]");
          await this.addCountDownGold(_0x55603a);
        } else {
          _0x1b3a7b.data.status == 1 ? console.log("时段红包[" + _0x55603a + "]冷却中，下次领取时间: " + _0x1b3a7b.data.nextTime) : console.log("今天时段红包[" + _0x55603a + "]次数已用完");
        }
      } else {
        console.log("查询时段红包[" + _0x55603a + "]失败: " + _0x1b3a7b.msg);
      }
    } catch (_0x5bfad5) {
      console.log(_0x5bfad5);
    } finally {}
  }
  async addCountDownGold(_0x7dece8) {
    try {
      let _0x5d4de8 = "https://goldcoin.zhuishushenqi.com/activity/addCountDownGold?b-zssq=zssq",
        _0x5288fc = "token=" + this.token + "&adType=" + _0x7dece8,
        _0x53f601 = _0x11505b(_0x5d4de8, this.deviceId, _0x5288fc);
      _0x53f601.headers["Content-Type"] = "application/x-www-form-urlencoded";
      await _0x5d8af2("post", _0x53f601);
      let _0x2c4deb = _0x2d24b1;
      if (!_0x2c4deb) {
        return;
      }
      if (_0x2c4deb.code == 0) {
        console.log("领取时段红包[" + _0x7dece8 + "]获得" + _0x2c4deb.data.gold + "金币");
        _0x2c4deb?.["data"]?.["videoId"];
      } else {
        console.log("领取时段红包[" + _0x7dece8 + "]失败: " + _0x2c4deb.msg);
      }
    } catch (_0x145b84) {
      console.log(_0x145b84);
    } finally {}
  }
  async addCountdownVideoGold(_0x357bdf, _0x2a117d) {
    try {
      let _0x37cdf3 = "http://goldcoin.zhuishushenqi.com/activity/addCountdownVideoGold",
        _0x20b6e8 = "{\"token\":\"" + this.token + "\",\"adType\":\"" + _0x357bdf + "\",\"data\":\"a7KlUX%2B09Sgkx3sPFPuHhoP9H5i02H9hjhuJhr7yY8ffaifx5FIhOIO%2FWh67UR8s%0D%0AUJqW9ALUMqrGbS8g4VeS4Q%3D%3D\",\"videoId\":\"" + _0x2a117d + "\",\"deviceId\":\"" + this.deviceId + "\"}",
        _0x2352a4 = _0x11505b(_0x37cdf3, this.deviceId, _0x20b6e8);
      await _0x5d8af2("post", _0x2352a4);
      let _0x8eb227 = _0x2d24b1;
      if (!_0x8eb227) {
        return;
      }
      _0x8eb227.code == 0 ? console.log("领取时段红包[" + _0x357bdf + "]翻倍视频奖励获得" + _0x8eb227.data.gold + "金币") : console.log("领取时段红包[" + _0x357bdf + "]翻倍视频奖励失败: " + _0x8eb227.msg);
    } catch (_0x108ff8) {
      console.log(_0x108ff8);
    } finally {}
  }
  async dailyQuesDistribution() {
    try {
      let _0x131223 = "https://activitynew.zhuishushenqi.com/activity/dailyQuestion/distribution",
        _0x49ef79 = "{\"action\":\"rw-daily-question\",\"appName\":\"iosMaster\",\"platform\":\"ios\",\"position\":\"goldTask\",\"taskVersion\":4001,\"token\":\"" + this.token + "\",\"version\":\"4.45.0\"}",
        _0x4e3f62 = _0x11505b(_0x131223, this.deviceId, _0x49ef79);
      await _0x5d8af2("post", _0x4e3f62);
      let _0x36940 = _0x2d24b1;
      if (!_0x36940) {
        return;
      }
      if (_0x36940.ecode == 0) {
        console.log("每日趣味问答进度：" + _0x36940.data.finished + "/" + _0x36940.data.count);
        if (_0x36940.data.finished < _0x36940.data.count) {
          for (let _0xb88947 of _0x36940.data.questions) {
            if (_0xb88947.isFinished == false) {
              await _0x457fc7.wait(2000);
              console.log("\n回答问题：" + _0xb88947.title);
              await this.dailyQuesAnswer(_0xb88947);
            } else {
              console.log("\n已回答的问题：" + _0xb88947.title);
              for (let _0x199592 in _0xb88947.options) {
                console.log(parseInt(_0x199592) + 1 + ": " + _0xb88947.options[_0x199592]);
              }
              console.log("你的答案：" + _0xb88947.options[_0xb88947.answer[0] - 1]);
              console.log("正确答案：" + _0xb88947.options[_0xb88947.rightAnswer[0] - 1]);
            }
          }
        }
      } else {
        console.log("获取每日趣味问答题目失败: " + _0x36940.message);
      }
    } catch (_0x3cd73d) {
      console.log(_0x3cd73d);
    } finally {}
  }
  async dailyQuesAnswer(_0x5d329b) {
    try {
      for (let _0x3b742f in _0x5d329b.options) {
        console.log(parseInt(_0x3b742f) + 1 + ": " + _0x5d329b.options[_0x3b742f]);
      }
      let _0x410fd5 = _0x1b42a9(_0x5d329b);
      console.log("选择回答: " + _0x5d329b.options[_0x410fd5]);
      let _0x34a012 = "https://activitynew.zhuishushenqi.com/activity/dailyQuestion/handle",
        _0x3105e9 = "{\"action\":\"rw-daily-question\",\"answers\":[{\"_id\":\"" + _0x5d329b._id + "\",\"answer\":[" + (_0x410fd5 + 1) + "]}],\"appName\":\"iosMaster\",\"platform\":\"ios\",\"position\":\"goldTask\",\"taskVersion\":4001,\"token\":\"" + this.token + "\",\"version\":\"4.45.0\",\"extData\":\"\"}",
        _0x2af75f = _0x11505b(_0x34a012, this.deviceId, _0x3105e9);
      await _0x5d8af2("post", _0x2af75f);
      let _0x104d26 = _0x2d24b1;
      if (!_0x104d26) {
        return;
      }
      if (_0x104d26.ecode == 0) {
        for (let _0x281263 of _0x104d26.data) {
          let _0x4af0d9 = "回答" + (_0x281263.isCorrect ? "正确" : "错误") + "，获得" + _0x281263.rewardExp + "经验，" + _0x281263.rewardGold + "金币";
          if (!_0x281263.isCorrect) {
            _0x4af0d9 += "\n正确答案是：" + _0x5d329b.options[_0x281263.rightAnswer[0] - 1];
          }
          console.log(_0x4af0d9);
        }
      } else {
        console.log("回答题目失败: " + _0x104d26.message);
      }
    } catch (_0x1e84c9) {
      console.log(_0x1e84c9);
    } finally {}
  }
  async withdrawList() {
    try {
      let _0x58ddbe = "https://convert.zhuishushenqi.com/convert/level?token=" + this.token,
        _0x5868b6 = "",
        _0xfff450 = _0x11505b(_0x58ddbe, this.deviceId, _0x5868b6);
      await _0x5d8af2("get", _0xfff450);
      let _0x2dd1d4 = _0x2d24b1;
      if (!_0x2dd1d4) {
        return;
      }
      if (_0x2dd1d4.ecode == 0) {
        for (let _0x4a51ff of _0x2dd1d4.data.sort(function (_0x52cf87, _0x1a2067) {
          return _0x1a2067.currency - _0x52cf87.currency;
        })) {
          if (_0x4a51ff.levelStatus == "reach" && _0x4a51ff.convertStatus == "unDraw") {
            await this.withdraw(_0x4a51ff);
            let _0x32ece6 = Math.floor(Math.random() * 5000) + 5000;
            await _0x457fc7.wait(_0x32ece6);
          }
        }
      } else {
        console.log("获取提现列表失败: " + _0x2dd1d4.message);
      }
    } catch (_0x581b56) {
      console.log(_0x581b56);
    } finally {}
  }
  async withdraw(_0x32ea37) {
    try {
      let _0x298c88 = "https://convert.zhuishushenqi.com/convert/withdraw",
        _0x4edacc = "{\"sm\":\"\",\"packageName\":\"com.ifmoc.ZhuiShuShenQi\",\"appName\":\"iosMaster\",\"token\":\"" + this.token + "\",\"level\":" + _0x32ea37.level + ",\"withdrawType\":\"cpt_weixin\",\"extData\":\"{\\\"$app_version\\\":\\\"4.45.0\\\",\\\"channel_name\\\":\\\"APST\\\",\\\"red_strategy_number\\\":\\\"13\\\",\\\"graytest_mark\\\":\\\"4.45.0\\\",\\\"user_ad_strategypositionId\\\":312,\\\"device_imei\\\":\\\"" + this.deviceId + "\\\",\\\"channel_id\\\":\\\"100013259\\\",\\\"red_user_current_level\\\":3,\\\"product_line\\\":\\\"1\\\",\\\"ua_channel_id\\\":\\\"100013259\\\",\\\"ua_channel_name\\\":\\\"APST\\\",\\\"is_vip\\\":false,\\\"new_user_welfare\\\":0,\\\"platform\\\":\\\"1\\\",\\\"red_user_getmoney_initial_level\\\":1,\\\"zs_login_id\\\":\\\"" + _0x457fc7.randomString(24) + "\\\",\\\"idfa\\\":\\\"" + this.deviceId + "\\\",\\\"pub_app_first_install_time\\\":\\\"2022-04-14 21:04:13\\\"}\"}",
        _0x1b0e72 = _0x11505b(_0x298c88, this.deviceId, _0x4edacc);
      _0x1b0e72.headers["Content-Type"] = "application/json;charset=utf-8";
      await _0x5d8af2("post", _0x1b0e72);
      let _0x441234 = _0x2d24b1;
      if (!_0x441234) {
        return;
      }
      _0x441234.ecode == 0 ? console.log("提现" + _0x441234.currency / 100 + "元成功") : console.log("提现失败: " + _0x441234.message);
    } catch (_0x503c46) {
      console.log(_0x503c46);
    } finally {}
  }
  async userTask() {
    console.log("\n============= 账号[" + this.index + "] =============");
    await this.getUserProfile();
    if (!this.valid) {
      return;
    }
    await this.judgeSignIn();
    await this.getCountdownGold("welfare");
    await this.getTaskList();
    for (let _0x5bddab of this.taskList) {
      await this.completeTask(_0x5bddab);
    }
    await this.dailyQuesDistribution();
    await this.withdrawList();
  }
}
!(async () => {
  if (typeof $request !== "undefined") {
    await _0x114d0e();
  } else {
    await _0x1288f6();
    if (_0x385a19 == false) {
      return;
    }
    if (!(await _0x227a15())) {
      return;
    }
    for (let _0x589d2b of _0x18c954) {
      await _0x589d2b.userTask();
    }
  }
})().catch(_0x3470a8 => console.log(_0x3470a8)).finally(() => _0x457fc7.done());
async function _0x114d0e() {
  if ($request.url.indexOf("goldcoinnew.zhuishushenqi.com/account/profile") > -1) {
    let _0x4a0b71 = $request.url.match(/token=([\w\-]+)/)[1];
    _0x3c09af ? _0x3c09af.indexOf(_0x4a0b71) == -1 && (_0x3c09af = _0x3c09af + "\n" + _0x4a0b71, _0x457fc7.setdata(_0x3c09af, "zssqCookie"), ckList = _0x3c09af.split("\n"), _0x457fc7.msg("获取第" + ckList.length + "个ck成功: " + _0x4a0b71)) : (_0x457fc7.setdata(_0x4a0b71, "zssqCookie"), _0x457fc7.msg("获取第1个ck成功: " + _0x4a0b71));
  }
}
async function _0x227a15() {
  if (_0x3c09af) {
    let _0x749f84 = _0x191186[0];
    for (let _0x46d91d of _0x191186) {
      if (_0x3c09af.indexOf(_0x46d91d) > -1) {
        _0x749f84 = _0x46d91d;
        break;
      }
    }
    for (let _0x3a1dee of _0x3c09af.split(_0x749f84)) {
      if (_0x3a1dee) {
        _0x18c954.push(new _0xa7fade(_0x3a1dee));
      }
    }
    _0x424318 = _0x18c954.length;
  } else {
    console.log("未找到CK");
    return;
  }
  console.log("共找到" + _0x424318 + "个账号");
  return true;
}
function _0x1b42a9(_0x5986cd) {
  let _0x594a68 = 1;
  try {
    let _0x1e4b9a = false;
    for (let _0xf44f9e of _0x241056) {
      if (_0x5986cd.title.indexOf(_0xf44f9e.keys) == -1) {
        continue;
      }
      _0x1e4b9a = true;
      for (let _0x44b8e9 in _0x5986cd.options) {
        if (_0x5986cd.options[_0x44b8e9].indexOf(_0xf44f9e.answer) > -1) {
          console.log("匹配到答案");
          _0x594a68 = parseInt(_0x44b8e9);
          break;
        }
      }
      break;
    }
    !_0x1e4b9a && (console.log("没有匹配到答案，选择随机答案"), _0x594a68 = Math.floor(Math.random() * _0x5986cd.options.length));
  } catch (_0x4f772d) {
    console.log(_0x4f772d);
  } finally {
    return _0x594a68;
  }
}
async function _0x1288f6() {
  const _0x519893 = {
    url: _0x1a2304
  };
  await _0x5d8af2("get", _0x519893);
  let _0x53fa3e = _0x2d24b1;
  if (!_0x53fa3e) {
    return;
  }
  if (_0x53fa3e[_0x496daa]) {
    let _0x28e787 = _0x53fa3e[_0x496daa];
    _0x28e787.status == 0 ? _0x51395c >= _0x28e787.version ? (_0x385a19 = true, console.log(_0x28e787.msg[_0x28e787.status]), console.log(_0x28e787.updateMsg), console.log("现在运行的脚本版本是：" + _0x51395c + "，最新脚本版本：" + _0x28e787.latestVersion)) : console.log(_0x28e787.versionMsg) : console.log(_0x28e787.msg[_0x28e787.status]);
  } else {
    console.log(_0x53fa3e.errorMsg);
  }
}
function _0x11505b(_0x1efd4d, _0x3af644, _0x4ad3f2 = "") {
  let _0x4d2879 = _0x1efd4d.replace("//", "/").split("/")[1];
  const _0x1d7ef7 = {
    Host: _0x4d2879,
    Connection: "keep-alive",
    "User-Agent": "Mozilla/5.0 (iPhone; CPU iPhone OS 15_0 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Mobile/15E148 /sa-sdk-ios/sensors-verify/endpoint.zhuishushenqi.com?production ",
    "X-Device-Id": _0x3af644
  };
  const _0xce2593 = {
    url: _0x1efd4d,
    headers: _0x1d7ef7,
    timeout: 5000
  };
  _0x4ad3f2 && (_0xce2593.body = _0x4ad3f2, _0xce2593.headers["Content-Type"] = "application/json", _0xce2593.headers["Content-Length"] = _0xce2593.body ? _0xce2593.body.length : 0);
  return _0xce2593;
}
async function _0x5d8af2(_0x58f788, _0x48868c) {
  _0x2d24b1 = null;
  _0x5a033e = null;
  _0x27354f = null;
  return new Promise(_0xbcf735 => {
    _0x457fc7.send(_0x58f788, _0x48868c, async (_0x5a0639, _0x1c83aa, _0x1a0052) => {
      try {
        _0x5a033e = _0x1c83aa;
        _0x27354f = _0x1a0052;
        if (_0x5a0639) {
          console.log(_0x58f788 + "请求失败");
          console.log(JSON.stringify(_0x5a0639));
        } else {
          if (_0x1a0052.body) {
            if (typeof _0x1a0052.body == "object") {
              _0x2d24b1 = _0x1a0052.body;
            } else {
              try {
                _0x2d24b1 = JSON.parse(_0x1a0052.body);
              } catch (_0x27feab) {
                _0x2d24b1 = _0x1a0052.body;
              }
            }
          }
        }
      } catch (_0x3755bb) {
        console.log(_0x3755bb);
      } finally {
        _0xbcf735();
      }
    });
  });
}
function _0x5038cc(_0x5840c1, _0x538469, _0x17da3f, _0x2b6031, _0x2d75e9, _0x436a9b) {
  return CryptoJS[_0x5840c1].encrypt(CryptoJS.enc.Utf8.parse(_0x2b6031), CryptoJS.enc.Utf8.parse(_0x2d75e9), {
    mode: CryptoJS.mode[_0x538469],
    padding: CryptoJS.pad[_0x17da3f],
    iv: CryptoJS.enc.Utf8.parse(_0x436a9b)
  }).ciphertext.toString(CryptoJS.enc.Base64);
}
function _0x9bd722(_0x54ede6, _0x5d1ba7, _0x2f7baa, _0xfceafd, _0x47fe1b, _0x544b24) {
  return CryptoJS[_0x54ede6].decrypt({
    ciphertext: CryptoJS.enc.Base64.parse(_0xfceafd)
  }, CryptoJS.enc.Utf8.parse(_0x47fe1b), {
    mode: CryptoJS.mode[_0x5d1ba7],
    padding: CryptoJS.pad[_0x2f7baa],
    iv: CryptoJS.enc.Utf8.parse(_0x544b24)
  }).toString(CryptoJS.enc.Utf8);
}
var _0x58a4f7 = {
  _keyStr: "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/=",
  encode: function (_0x55441f) {
    var _0xac3253 = "";
    var _0x3337cf, _0x3890bd, _0x55c049, _0x4ddaa4, _0x5f4417, _0x5d5b76, _0x46e44b;
    var _0x3a731e = 0;
    _0x55441f = _0x58a4f7._utf8_encode(_0x55441f);
    while (_0x3a731e < _0x55441f.length) {
      _0x3337cf = _0x55441f.charCodeAt(_0x3a731e++);
      _0x3890bd = _0x55441f.charCodeAt(_0x3a731e++);
      _0x55c049 = _0x55441f.charCodeAt(_0x3a731e++);
      _0x4ddaa4 = _0x3337cf >> 2;
      _0x5f4417 = (_0x3337cf & 3) << 4 | _0x3890bd >> 4;
      _0x5d5b76 = (_0x3890bd & 15) << 2 | _0x55c049 >> 6;
      _0x46e44b = _0x55c049 & 63;
      if (isNaN(_0x3890bd)) {
        _0x5d5b76 = _0x46e44b = 64;
      } else {
        isNaN(_0x55c049) && (_0x46e44b = 64);
      }
      _0xac3253 = _0xac3253 + this._keyStr.charAt(_0x4ddaa4) + this._keyStr.charAt(_0x5f4417) + this._keyStr.charAt(_0x5d5b76) + this._keyStr.charAt(_0x46e44b);
    }
    return _0xac3253;
  },
  decode: function (_0x55bc37) {
    var _0x229a19 = "";
    var _0x14917c, _0x38fd2e, _0x26f3c3;
    var _0x5cd33c, _0x29e39e, _0x59c765, _0x4a8fc1;
    var _0x3d2c51 = 0;
    _0x55bc37 = _0x55bc37.replace(/[^A-Za-z0-9+/=]/g, "");
    while (_0x3d2c51 < _0x55bc37.length) {
      _0x5cd33c = this._keyStr.indexOf(_0x55bc37.charAt(_0x3d2c51++));
      _0x29e39e = this._keyStr.indexOf(_0x55bc37.charAt(_0x3d2c51++));
      _0x59c765 = this._keyStr.indexOf(_0x55bc37.charAt(_0x3d2c51++));
      _0x4a8fc1 = this._keyStr.indexOf(_0x55bc37.charAt(_0x3d2c51++));
      _0x14917c = _0x5cd33c << 2 | _0x29e39e >> 4;
      _0x38fd2e = (_0x29e39e & 15) << 4 | _0x59c765 >> 2;
      _0x26f3c3 = (_0x59c765 & 3) << 6 | _0x4a8fc1;
      _0x229a19 = _0x229a19 + String.fromCharCode(_0x14917c);
      _0x59c765 != 64 && (_0x229a19 = _0x229a19 + String.fromCharCode(_0x38fd2e));
      _0x4a8fc1 != 64 && (_0x229a19 = _0x229a19 + String.fromCharCode(_0x26f3c3));
    }
    _0x229a19 = _0x58a4f7._utf8_decode(_0x229a19);
    return _0x229a19;
  },
  _utf8_encode: function (_0x51738c) {
    _0x51738c = _0x51738c.replace(/rn/g, "n");
    var _0x5b2bfa = "";
    for (var _0x493123 = 0; _0x493123 < _0x51738c.length; _0x493123++) {
      var _0x1edc33 = _0x51738c.charCodeAt(_0x493123);
      if (_0x1edc33 < 128) {
        _0x5b2bfa += String.fromCharCode(_0x1edc33);
      } else {
        _0x1edc33 > 127 && _0x1edc33 < 2048 ? (_0x5b2bfa += String.fromCharCode(_0x1edc33 >> 6 | 192), _0x5b2bfa += String.fromCharCode(_0x1edc33 & 63 | 128)) : (_0x5b2bfa += String.fromCharCode(_0x1edc33 >> 12 | 224), _0x5b2bfa += String.fromCharCode(_0x1edc33 >> 6 & 63 | 128), _0x5b2bfa += String.fromCharCode(_0x1edc33 & 63 | 128));
      }
    }
    return _0x5b2bfa;
  },
  _utf8_decode: function (_0x3aa7de) {
    var _0x27d8c0 = "";
    var _0x5c3dd5 = 0;
    c1 = c2 = 0;
    var _0x25fac8 = c1;
    while (_0x5c3dd5 < _0x3aa7de.length) {
      _0x25fac8 = _0x3aa7de.charCodeAt(_0x5c3dd5);
      if (_0x25fac8 < 128) {
        _0x27d8c0 += String.fromCharCode(_0x25fac8);
        _0x5c3dd5++;
      } else {
        _0x25fac8 > 191 && _0x25fac8 < 224 ? (c2 = _0x3aa7de.charCodeAt(_0x5c3dd5 + 1), _0x27d8c0 += String.fromCharCode((_0x25fac8 & 31) << 6 | c2 & 63), _0x5c3dd5 += 2) : (c2 = _0x3aa7de.charCodeAt(_0x5c3dd5 + 1), c3 = _0x3aa7de.charCodeAt(_0x5c3dd5 + 2), _0x27d8c0 += String.fromCharCode((_0x25fac8 & 15) << 12 | (c2 & 63) << 6 | c3 & 63), _0x5c3dd5 += 3);
      }
    }
    return _0x27d8c0;
  }
};
function _0x572b87(_0x5b6820) {
  function _0x43ef22(_0xe8b7f, _0x2fef6b) {
    return _0xe8b7f << _0x2fef6b | _0xe8b7f >>> 32 - _0x2fef6b;
  }
  function _0x47d4fe(_0x2fe455, _0x104aa2) {
    var _0x486923, _0x805e0e, _0x16ceb0, _0x235aa3, _0x5b3568;
    _0x16ceb0 = 2147483648 & _0x2fe455;
    _0x235aa3 = 2147483648 & _0x104aa2;
    _0x486923 = 1073741824 & _0x2fe455;
    _0x805e0e = 1073741824 & _0x104aa2;
    _0x5b3568 = (1073741823 & _0x2fe455) + (1073741823 & _0x104aa2);
    return _0x486923 & _0x805e0e ? 2147483648 ^ _0x5b3568 ^ _0x16ceb0 ^ _0x235aa3 : _0x486923 | _0x805e0e ? 1073741824 & _0x5b3568 ? 3221225472 ^ _0x5b3568 ^ _0x16ceb0 ^ _0x235aa3 : 1073741824 ^ _0x5b3568 ^ _0x16ceb0 ^ _0x235aa3 : _0x5b3568 ^ _0x16ceb0 ^ _0x235aa3;
  }
  function _0x34a355(_0x2b92a0, _0x40a434, _0x28c711) {
    return _0x2b92a0 & _0x40a434 | ~_0x2b92a0 & _0x28c711;
  }
  function _0x1cbdd1(_0x41ceb5, _0x3bf85d, _0x214ea2) {
    return _0x41ceb5 & _0x214ea2 | _0x3bf85d & ~_0x214ea2;
  }
  function _0x4ecbb0(_0x239717, _0x38c01c, _0x56aceb) {
    return _0x239717 ^ _0x38c01c ^ _0x56aceb;
  }
  function _0x3f2a7e(_0x552889, _0x5e79b2, _0x2b89b6) {
    return _0x5e79b2 ^ (_0x552889 | ~_0x2b89b6);
  }
  function _0x562692(_0x5dcc85, _0x4c12c3, _0x419a39, _0x553c01, _0x35baae, _0x9131c6, _0x1571a5) {
    _0x5dcc85 = _0x47d4fe(_0x5dcc85, _0x47d4fe(_0x47d4fe(_0x34a355(_0x4c12c3, _0x419a39, _0x553c01), _0x35baae), _0x1571a5));
    return _0x47d4fe(_0x43ef22(_0x5dcc85, _0x9131c6), _0x4c12c3);
  }
  function _0x455b8a(_0x448581, _0x121992, _0x31f86d, _0x536e11, _0x55684a, _0x9c71df, _0x2b8c5d) {
    _0x448581 = _0x47d4fe(_0x448581, _0x47d4fe(_0x47d4fe(_0x1cbdd1(_0x121992, _0x31f86d, _0x536e11), _0x55684a), _0x2b8c5d));
    return _0x47d4fe(_0x43ef22(_0x448581, _0x9c71df), _0x121992);
  }
  function _0x59d39b(_0x549987, _0x11a463, _0x306834, _0x5c5061, _0x273fbd, _0x26c736, _0x3e1189) {
    _0x549987 = _0x47d4fe(_0x549987, _0x47d4fe(_0x47d4fe(_0x4ecbb0(_0x11a463, _0x306834, _0x5c5061), _0x273fbd), _0x3e1189));
    return _0x47d4fe(_0x43ef22(_0x549987, _0x26c736), _0x11a463);
  }
  function _0x2e5421(_0x316da4, _0x1ab68a, _0x129eb2, _0x9c20c, _0x5eee9a, _0x477335, _0x5c9158) {
    _0x316da4 = _0x47d4fe(_0x316da4, _0x47d4fe(_0x47d4fe(_0x3f2a7e(_0x1ab68a, _0x129eb2, _0x9c20c), _0x5eee9a), _0x5c9158));
    return _0x47d4fe(_0x43ef22(_0x316da4, _0x477335), _0x1ab68a);
  }
  function _0x1515a7(_0x1701f2) {
    for (var _0x32b355, _0x4d1f7a = _0x1701f2.length, _0x1ba0a8 = _0x4d1f7a + 8, _0x30bab0 = (_0x1ba0a8 - _0x1ba0a8 % 64) / 64, _0x977219 = 16 * (_0x30bab0 + 1), _0xc337ec = new Array(_0x977219 - 1), _0x1c271f = 0, _0x15d380 = 0; _0x4d1f7a > _0x15d380;) {
      _0x32b355 = (_0x15d380 - _0x15d380 % 4) / 4;
      _0x1c271f = _0x15d380 % 4 * 8;
      _0xc337ec[_0x32b355] = _0xc337ec[_0x32b355] | _0x1701f2.charCodeAt(_0x15d380) << _0x1c271f;
      _0x15d380++;
    }
    _0x32b355 = (_0x15d380 - _0x15d380 % 4) / 4;
    _0x1c271f = _0x15d380 % 4 * 8;
    _0xc337ec[_0x32b355] = _0xc337ec[_0x32b355] | 128 << _0x1c271f;
    _0xc337ec[_0x977219 - 2] = _0x4d1f7a << 3;
    _0xc337ec[_0x977219 - 1] = _0x4d1f7a >>> 29;
    return _0xc337ec;
  }
  function _0x226032(_0xea851a) {
    var _0x856fc7,
      _0x3d1530,
      _0x6d7f8c = "",
      _0x2bbe7b = "";
    for (_0x3d1530 = 0; 3 >= _0x3d1530; _0x3d1530++) {
      _0x856fc7 = _0xea851a >>> 8 * _0x3d1530 & 255;
      _0x2bbe7b = "0" + _0x856fc7.toString(16);
      _0x6d7f8c += _0x2bbe7b.substr(_0x2bbe7b.length - 2, 2);
    }
    return _0x6d7f8c;
  }
  function _0x141fce(_0x31b4b3) {
    _0x31b4b3 = _0x31b4b3.replace(/\r\n/g, "\n");
    for (var _0x355a9 = "", _0x221bad = 0; _0x221bad < _0x31b4b3.length; _0x221bad++) {
      var _0x49368c = _0x31b4b3.charCodeAt(_0x221bad);
      128 > _0x49368c ? _0x355a9 += String.fromCharCode(_0x49368c) : _0x49368c > 127 && 2048 > _0x49368c ? (_0x355a9 += String.fromCharCode(_0x49368c >> 6 | 192), _0x355a9 += String.fromCharCode(63 & _0x49368c | 128)) : (_0x355a9 += String.fromCharCode(_0x49368c >> 12 | 224), _0x355a9 += String.fromCharCode(_0x49368c >> 6 & 63 | 128), _0x355a9 += String.fromCharCode(63 & _0x49368c | 128));
    }
    return _0x355a9;
  }
  var _0x17e8d5,
    _0x11f18a,
    _0x407088,
    _0x3d10f9,
    _0x2b4979,
    _0x4917f7,
    _0x4400a2,
    _0x3b2ac5,
    _0x5b9522,
    _0x94e6a8 = [],
    _0x35cb36 = 7,
    _0x5d584f = 12,
    _0x38d1fc = 17,
    _0x3d8da9 = 22,
    _0x352102 = 5,
    _0x144530 = 9,
    _0x180875 = 14,
    _0x2061c3 = 20,
    _0x2de560 = 4,
    _0x3ba82b = 11,
    _0x465a57 = 16,
    _0x37ba5f = 23,
    _0x1aecf0 = 6,
    _0x4a5878 = 10,
    _0x518655 = 15,
    _0x58134b = 21;
  for (_0x5b6820 = _0x141fce(_0x5b6820), _0x94e6a8 = _0x1515a7(_0x5b6820), _0x4917f7 = 1732584193, _0x4400a2 = 4023233417, _0x3b2ac5 = 2562383102, _0x5b9522 = 271733878, _0x17e8d5 = 0; _0x17e8d5 < _0x94e6a8.length; _0x17e8d5 += 16) {
    _0x11f18a = _0x4917f7;
    _0x407088 = _0x4400a2;
    _0x3d10f9 = _0x3b2ac5;
    _0x2b4979 = _0x5b9522;
    _0x4917f7 = _0x562692(_0x4917f7, _0x4400a2, _0x3b2ac5, _0x5b9522, _0x94e6a8[_0x17e8d5 + 0], _0x35cb36, 3614090360);
    _0x5b9522 = _0x562692(_0x5b9522, _0x4917f7, _0x4400a2, _0x3b2ac5, _0x94e6a8[_0x17e8d5 + 1], _0x5d584f, 3905402710);
    _0x3b2ac5 = _0x562692(_0x3b2ac5, _0x5b9522, _0x4917f7, _0x4400a2, _0x94e6a8[_0x17e8d5 + 2], _0x38d1fc, 606105819);
    _0x4400a2 = _0x562692(_0x4400a2, _0x3b2ac5, _0x5b9522, _0x4917f7, _0x94e6a8[_0x17e8d5 + 3], _0x3d8da9, 3250441966);
    _0x4917f7 = _0x562692(_0x4917f7, _0x4400a2, _0x3b2ac5, _0x5b9522, _0x94e6a8[_0x17e8d5 + 4], _0x35cb36, 4118548399);
    _0x5b9522 = _0x562692(_0x5b9522, _0x4917f7, _0x4400a2, _0x3b2ac5, _0x94e6a8[_0x17e8d5 + 5], _0x5d584f, 1200080426);
    _0x3b2ac5 = _0x562692(_0x3b2ac5, _0x5b9522, _0x4917f7, _0x4400a2, _0x94e6a8[_0x17e8d5 + 6], _0x38d1fc, 2821735955);
    _0x4400a2 = _0x562692(_0x4400a2, _0x3b2ac5, _0x5b9522, _0x4917f7, _0x94e6a8[_0x17e8d5 + 7], _0x3d8da9, 4249261313);
    _0x4917f7 = _0x562692(_0x4917f7, _0x4400a2, _0x3b2ac5, _0x5b9522, _0x94e6a8[_0x17e8d5 + 8], _0x35cb36, 1770035416);
    _0x5b9522 = _0x562692(_0x5b9522, _0x4917f7, _0x4400a2, _0x3b2ac5, _0x94e6a8[_0x17e8d5 + 9], _0x5d584f, 2336552879);
    _0x3b2ac5 = _0x562692(_0x3b2ac5, _0x5b9522, _0x4917f7, _0x4400a2, _0x94e6a8[_0x17e8d5 + 10], _0x38d1fc, 4294925233);
    _0x4400a2 = _0x562692(_0x4400a2, _0x3b2ac5, _0x5b9522, _0x4917f7, _0x94e6a8[_0x17e8d5 + 11], _0x3d8da9, 2304563134);
    _0x4917f7 = _0x562692(_0x4917f7, _0x4400a2, _0x3b2ac5, _0x5b9522, _0x94e6a8[_0x17e8d5 + 12], _0x35cb36, 1804603682);
    _0x5b9522 = _0x562692(_0x5b9522, _0x4917f7, _0x4400a2, _0x3b2ac5, _0x94e6a8[_0x17e8d5 + 13], _0x5d584f, 4254626195);
    _0x3b2ac5 = _0x562692(_0x3b2ac5, _0x5b9522, _0x4917f7, _0x4400a2, _0x94e6a8[_0x17e8d5 + 14], _0x38d1fc, 2792965006);
    _0x4400a2 = _0x562692(_0x4400a2, _0x3b2ac5, _0x5b9522, _0x4917f7, _0x94e6a8[_0x17e8d5 + 15], _0x3d8da9, 1236535329);
    _0x4917f7 = _0x455b8a(_0x4917f7, _0x4400a2, _0x3b2ac5, _0x5b9522, _0x94e6a8[_0x17e8d5 + 1], _0x352102, 4129170786);
    _0x5b9522 = _0x455b8a(_0x5b9522, _0x4917f7, _0x4400a2, _0x3b2ac5, _0x94e6a8[_0x17e8d5 + 6], _0x144530, 3225465664);
    _0x3b2ac5 = _0x455b8a(_0x3b2ac5, _0x5b9522, _0x4917f7, _0x4400a2, _0x94e6a8[_0x17e8d5 + 11], _0x180875, 643717713);
    _0x4400a2 = _0x455b8a(_0x4400a2, _0x3b2ac5, _0x5b9522, _0x4917f7, _0x94e6a8[_0x17e8d5 + 0], _0x2061c3, 3921069994);
    _0x4917f7 = _0x455b8a(_0x4917f7, _0x4400a2, _0x3b2ac5, _0x5b9522, _0x94e6a8[_0x17e8d5 + 5], _0x352102, 3593408605);
    _0x5b9522 = _0x455b8a(_0x5b9522, _0x4917f7, _0x4400a2, _0x3b2ac5, _0x94e6a8[_0x17e8d5 + 10], _0x144530, 38016083);
    _0x3b2ac5 = _0x455b8a(_0x3b2ac5, _0x5b9522, _0x4917f7, _0x4400a2, _0x94e6a8[_0x17e8d5 + 15], _0x180875, 3634488961);
    _0x4400a2 = _0x455b8a(_0x4400a2, _0x3b2ac5, _0x5b9522, _0x4917f7, _0x94e6a8[_0x17e8d5 + 4], _0x2061c3, 3889429448);
    _0x4917f7 = _0x455b8a(_0x4917f7, _0x4400a2, _0x3b2ac5, _0x5b9522, _0x94e6a8[_0x17e8d5 + 9], _0x352102, 568446438);
    _0x5b9522 = _0x455b8a(_0x5b9522, _0x4917f7, _0x4400a2, _0x3b2ac5, _0x94e6a8[_0x17e8d5 + 14], _0x144530, 3275163606);
    _0x3b2ac5 = _0x455b8a(_0x3b2ac5, _0x5b9522, _0x4917f7, _0x4400a2, _0x94e6a8[_0x17e8d5 + 3], _0x180875, 4107603335);
    _0x4400a2 = _0x455b8a(_0x4400a2, _0x3b2ac5, _0x5b9522, _0x4917f7, _0x94e6a8[_0x17e8d5 + 8], _0x2061c3, 1163531501);
    _0x4917f7 = _0x455b8a(_0x4917f7, _0x4400a2, _0x3b2ac5, _0x5b9522, _0x94e6a8[_0x17e8d5 + 13], _0x352102, 2850285829);
    _0x5b9522 = _0x455b8a(_0x5b9522, _0x4917f7, _0x4400a2, _0x3b2ac5, _0x94e6a8[_0x17e8d5 + 2], _0x144530, 4243563512);
    _0x3b2ac5 = _0x455b8a(_0x3b2ac5, _0x5b9522, _0x4917f7, _0x4400a2, _0x94e6a8[_0x17e8d5 + 7], _0x180875, 1735328473);
    _0x4400a2 = _0x455b8a(_0x4400a2, _0x3b2ac5, _0x5b9522, _0x4917f7, _0x94e6a8[_0x17e8d5 + 12], _0x2061c3, 2368359562);
    _0x4917f7 = _0x59d39b(_0x4917f7, _0x4400a2, _0x3b2ac5, _0x5b9522, _0x94e6a8[_0x17e8d5 + 5], _0x2de560, 4294588738);
    _0x5b9522 = _0x59d39b(_0x5b9522, _0x4917f7, _0x4400a2, _0x3b2ac5, _0x94e6a8[_0x17e8d5 + 8], _0x3ba82b, 2272392833);
    _0x3b2ac5 = _0x59d39b(_0x3b2ac5, _0x5b9522, _0x4917f7, _0x4400a2, _0x94e6a8[_0x17e8d5 + 11], _0x465a57, 1839030562);
    _0x4400a2 = _0x59d39b(_0x4400a2, _0x3b2ac5, _0x5b9522, _0x4917f7, _0x94e6a8[_0x17e8d5 + 14], _0x37ba5f, 4259657740);
    _0x4917f7 = _0x59d39b(_0x4917f7, _0x4400a2, _0x3b2ac5, _0x5b9522, _0x94e6a8[_0x17e8d5 + 1], _0x2de560, 2763975236);
    _0x5b9522 = _0x59d39b(_0x5b9522, _0x4917f7, _0x4400a2, _0x3b2ac5, _0x94e6a8[_0x17e8d5 + 4], _0x3ba82b, 1272893353);
    _0x3b2ac5 = _0x59d39b(_0x3b2ac5, _0x5b9522, _0x4917f7, _0x4400a2, _0x94e6a8[_0x17e8d5 + 7], _0x465a57, 4139469664);
    _0x4400a2 = _0x59d39b(_0x4400a2, _0x3b2ac5, _0x5b9522, _0x4917f7, _0x94e6a8[_0x17e8d5 + 10], _0x37ba5f, 3200236656);
    _0x4917f7 = _0x59d39b(_0x4917f7, _0x4400a2, _0x3b2ac5, _0x5b9522, _0x94e6a8[_0x17e8d5 + 13], _0x2de560, 681279174);
    _0x5b9522 = _0x59d39b(_0x5b9522, _0x4917f7, _0x4400a2, _0x3b2ac5, _0x94e6a8[_0x17e8d5 + 0], _0x3ba82b, 3936430074);
    _0x3b2ac5 = _0x59d39b(_0x3b2ac5, _0x5b9522, _0x4917f7, _0x4400a2, _0x94e6a8[_0x17e8d5 + 3], _0x465a57, 3572445317);
    _0x4400a2 = _0x59d39b(_0x4400a2, _0x3b2ac5, _0x5b9522, _0x4917f7, _0x94e6a8[_0x17e8d5 + 6], _0x37ba5f, 76029189);
    _0x4917f7 = _0x59d39b(_0x4917f7, _0x4400a2, _0x3b2ac5, _0x5b9522, _0x94e6a8[_0x17e8d5 + 9], _0x2de560, 3654602809);
    _0x5b9522 = _0x59d39b(_0x5b9522, _0x4917f7, _0x4400a2, _0x3b2ac5, _0x94e6a8[_0x17e8d5 + 12], _0x3ba82b, 3873151461);
    _0x3b2ac5 = _0x59d39b(_0x3b2ac5, _0x5b9522, _0x4917f7, _0x4400a2, _0x94e6a8[_0x17e8d5 + 15], _0x465a57, 530742520);
    _0x4400a2 = _0x59d39b(_0x4400a2, _0x3b2ac5, _0x5b9522, _0x4917f7, _0x94e6a8[_0x17e8d5 + 2], _0x37ba5f, 3299628645);
    _0x4917f7 = _0x2e5421(_0x4917f7, _0x4400a2, _0x3b2ac5, _0x5b9522, _0x94e6a8[_0x17e8d5 + 0], _0x1aecf0, 4096336452);
    _0x5b9522 = _0x2e5421(_0x5b9522, _0x4917f7, _0x4400a2, _0x3b2ac5, _0x94e6a8[_0x17e8d5 + 7], _0x4a5878, 1126891415);
    _0x3b2ac5 = _0x2e5421(_0x3b2ac5, _0x5b9522, _0x4917f7, _0x4400a2, _0x94e6a8[_0x17e8d5 + 14], _0x518655, 2878612391);
    _0x4400a2 = _0x2e5421(_0x4400a2, _0x3b2ac5, _0x5b9522, _0x4917f7, _0x94e6a8[_0x17e8d5 + 5], _0x58134b, 4237533241);
    _0x4917f7 = _0x2e5421(_0x4917f7, _0x4400a2, _0x3b2ac5, _0x5b9522, _0x94e6a8[_0x17e8d5 + 12], _0x1aecf0, 1700485571);
    _0x5b9522 = _0x2e5421(_0x5b9522, _0x4917f7, _0x4400a2, _0x3b2ac5, _0x94e6a8[_0x17e8d5 + 3], _0x4a5878, 2399980690);
    _0x3b2ac5 = _0x2e5421(_0x3b2ac5, _0x5b9522, _0x4917f7, _0x4400a2, _0x94e6a8[_0x17e8d5 + 10], _0x518655, 4293915773);
    _0x4400a2 = _0x2e5421(_0x4400a2, _0x3b2ac5, _0x5b9522, _0x4917f7, _0x94e6a8[_0x17e8d5 + 1], _0x58134b, 2240044497);
    _0x4917f7 = _0x2e5421(_0x4917f7, _0x4400a2, _0x3b2ac5, _0x5b9522, _0x94e6a8[_0x17e8d5 + 8], _0x1aecf0, 1873313359);
    _0x5b9522 = _0x2e5421(_0x5b9522, _0x4917f7, _0x4400a2, _0x3b2ac5, _0x94e6a8[_0x17e8d5 + 15], _0x4a5878, 4264355552);
    _0x3b2ac5 = _0x2e5421(_0x3b2ac5, _0x5b9522, _0x4917f7, _0x4400a2, _0x94e6a8[_0x17e8d5 + 6], _0x518655, 2734768916);
    _0x4400a2 = _0x2e5421(_0x4400a2, _0x3b2ac5, _0x5b9522, _0x4917f7, _0x94e6a8[_0x17e8d5 + 13], _0x58134b, 1309151649);
    _0x4917f7 = _0x2e5421(_0x4917f7, _0x4400a2, _0x3b2ac5, _0x5b9522, _0x94e6a8[_0x17e8d5 + 4], _0x1aecf0, 4149444226);
    _0x5b9522 = _0x2e5421(_0x5b9522, _0x4917f7, _0x4400a2, _0x3b2ac5, _0x94e6a8[_0x17e8d5 + 11], _0x4a5878, 3174756917);
    _0x3b2ac5 = _0x2e5421(_0x3b2ac5, _0x5b9522, _0x4917f7, _0x4400a2, _0x94e6a8[_0x17e8d5 + 2], _0x518655, 718787259);
    _0x4400a2 = _0x2e5421(_0x4400a2, _0x3b2ac5, _0x5b9522, _0x4917f7, _0x94e6a8[_0x17e8d5 + 9], _0x58134b, 3951481745);
    _0x4917f7 = _0x47d4fe(_0x4917f7, _0x11f18a);
    _0x4400a2 = _0x47d4fe(_0x4400a2, _0x407088);
    _0x3b2ac5 = _0x47d4fe(_0x3b2ac5, _0x3d10f9);
    _0x5b9522 = _0x47d4fe(_0x5b9522, _0x2b4979);
  }
  var _0x518efb = _0x226032(_0x4917f7) + _0x226032(_0x4400a2) + _0x226032(_0x3b2ac5) + _0x226032(_0x5b9522);
  return _0x518efb.toLowerCase();
}
function _0x2ad9d(_0x39a4ae) {
  function _0x4bbec9(_0x48b68c, _0x534669) {
    return (_0x48b68c & 2147483647) + (_0x534669 & 2147483647) ^ _0x48b68c & 2147483648 ^ _0x534669 & 2147483648;
  }
  function _0x2bb688(_0x4e6936) {
    var _0x2bbded = "0123456789abcdef",
      _0x277ee3 = "";
    for (var _0x40cd78 = 7; _0x40cd78 >= 0; _0x40cd78--) {
      _0x277ee3 += _0x2bbded.charAt(_0x4e6936 >> _0x40cd78 * 4 & 15);
    }
    return _0x277ee3;
  }
  function _0x43189c(_0x2b8314) {
    var _0x72a0ee = (_0x2b8314.length + 8 >> 6) + 1,
      _0x1f3be1 = new Array(_0x72a0ee * 16);
    for (var _0x478b17 = 0; _0x478b17 < _0x72a0ee * 16; _0x478b17++) {
      _0x1f3be1[_0x478b17] = 0;
    }
    for (_0x478b17 = 0; _0x478b17 < _0x2b8314.length; _0x478b17++) {
      _0x1f3be1[_0x478b17 >> 2] |= _0x2b8314.charCodeAt(_0x478b17) << 24 - (_0x478b17 & 3) * 8;
    }
    _0x1f3be1[_0x478b17 >> 2] |= 128 << 24 - (_0x478b17 & 3) * 8;
    _0x1f3be1[_0x72a0ee * 16 - 1] = _0x2b8314.length * 8;
    return _0x1f3be1;
  }
  function _0x4cc36d(_0x4aec18, _0x1ff6f7) {
    return _0x4aec18 << _0x1ff6f7 | _0x4aec18 >>> 32 - _0x1ff6f7;
  }
  function _0x52f7a5(_0x110565, _0x550a26, _0x34d9c1, _0x1005a7) {
    if (_0x110565 < 20) {
      return _0x550a26 & _0x34d9c1 | ~_0x550a26 & _0x1005a7;
    }
    if (_0x110565 < 40) {
      return _0x550a26 ^ _0x34d9c1 ^ _0x1005a7;
    }
    if (_0x110565 < 60) {
      return _0x550a26 & _0x34d9c1 | _0x550a26 & _0x1005a7 | _0x34d9c1 & _0x1005a7;
    }
    return _0x550a26 ^ _0x34d9c1 ^ _0x1005a7;
  }
  function _0x39316f(_0xb97d9) {
    return _0xb97d9 < 20 ? 1518500249 : _0xb97d9 < 40 ? 1859775393 : _0xb97d9 < 60 ? -1894007588 : -899497514;
  }
  var _0x37e9f8 = _0x43189c(_0x39a4ae),
    _0x1ca652 = new Array(80),
    _0x105597 = 1732584193,
    _0x376e02 = -271733879,
    _0x2cde41 = -1732584194,
    _0x33a2eb = 271733878,
    _0x352b8b = -1009589776;
  for (var _0x318d2d = 0; _0x318d2d < _0x37e9f8.length; _0x318d2d += 16) {
    var _0x24d758 = _0x105597,
      _0x23c52f = _0x376e02,
      _0x25e23d = _0x2cde41,
      _0x276194 = _0x33a2eb,
      _0x35782f = _0x352b8b;
    for (var _0x97d8a4 = 0; _0x97d8a4 < 80; _0x97d8a4++) {
      if (_0x97d8a4 < 16) {
        _0x1ca652[_0x97d8a4] = _0x37e9f8[_0x318d2d + _0x97d8a4];
      } else {
        _0x1ca652[_0x97d8a4] = _0x4cc36d(_0x1ca652[_0x97d8a4 - 3] ^ _0x1ca652[_0x97d8a4 - 8] ^ _0x1ca652[_0x97d8a4 - 14] ^ _0x1ca652[_0x97d8a4 - 16], 1);
      }
      t = _0x4bbec9(_0x4bbec9(_0x4cc36d(_0x105597, 5), _0x52f7a5(_0x97d8a4, _0x376e02, _0x2cde41, _0x33a2eb)), _0x4bbec9(_0x4bbec9(_0x352b8b, _0x1ca652[_0x97d8a4]), _0x39316f(_0x97d8a4)));
      _0x352b8b = _0x33a2eb;
      _0x33a2eb = _0x2cde41;
      _0x2cde41 = _0x4cc36d(_0x376e02, 30);
      _0x376e02 = _0x105597;
      _0x105597 = t;
    }
    _0x105597 = _0x4bbec9(_0x105597, _0x24d758);
    _0x376e02 = _0x4bbec9(_0x376e02, _0x23c52f);
    _0x2cde41 = _0x4bbec9(_0x2cde41, _0x25e23d);
    _0x33a2eb = _0x4bbec9(_0x33a2eb, _0x276194);
    _0x352b8b = _0x4bbec9(_0x352b8b, _0x35782f);
  }
  SHA1Value = _0x2bb688(_0x105597) + _0x2bb688(_0x376e02) + _0x2bb688(_0x2cde41) + _0x2bb688(_0x33a2eb) + _0x2bb688(_0x352b8b);
  return SHA1Value;
}
function _0x5bcdd6(_0x4e7f4f, _0x4ca4c5) {
  "undefined" != typeof process && JSON.stringify(process.env).indexOf("GITHUB") > -1 && process.exit(0);
  return new class {
    constructor(_0x23a802, _0x4c19b4) {
      this.name = _0x23a802;
      this.notifyStr = "";
      this.startTime = new Date().getTime();
      Object.assign(this, _0x4c19b4);
      console.log(this.name + " 开始运行：\n");
    }
    isNode() {
      return "undefined" != typeof module && !!module.exports;
    }
    isQuanX() {
      return "undefined" != typeof $task;
    }
    isSurge() {
      return "undefined" != typeof $httpClient && "undefined" == typeof $loon;
    }
    isLoon() {
      return "undefined" != typeof $loon;
    }
    getdata(_0x1f7781) {
      let _0x4cfe1c = this.getval(_0x1f7781);
      if (/^@/.test(_0x1f7781)) {
        const [, _0x9af429, _0x359790] = /^@(.*?)\.(.*?)$/.exec(_0x1f7781),
          _0x297cd6 = _0x9af429 ? this.getval(_0x9af429) : "";
        if (_0x297cd6) {
          try {
            const _0x154fb8 = JSON.parse(_0x297cd6);
            _0x4cfe1c = _0x154fb8 ? this.lodash_get(_0x154fb8, _0x359790, "") : _0x4cfe1c;
          } catch (_0x169cd7) {
            _0x4cfe1c = "";
          }
        }
      }
      return _0x4cfe1c;
    }
    setdata(_0x302c56, _0x220b1e) {
      let _0x286c93 = !1;
      if (/^@/.test(_0x220b1e)) {
        const [, _0xa52c98, _0x59f920] = /^@(.*?)\.(.*?)$/.exec(_0x220b1e),
          _0xb2214 = this.getval(_0xa52c98),
          _0x21856d = _0xa52c98 ? "null" === _0xb2214 ? null : _0xb2214 || "{}" : "{}";
        try {
          const _0x1aff70 = JSON.parse(_0x21856d);
          this.lodash_set(_0x1aff70, _0x59f920, _0x302c56);
          _0x286c93 = this.setval(JSON.stringify(_0x1aff70), _0xa52c98);
        } catch (_0x17b83b) {
          const _0x31ee7c = {};
          this.lodash_set(_0x31ee7c, _0x59f920, _0x302c56);
          _0x286c93 = this.setval(JSON.stringify(_0x31ee7c), _0xa52c98);
        }
      } else {
        _0x286c93 = this.setval(_0x302c56, _0x220b1e);
      }
      return _0x286c93;
    }
    getval(_0xe41f4f) {
      return this.isSurge() || this.isLoon() ? $persistentStore.read(_0xe41f4f) : this.isQuanX() ? $prefs.valueForKey(_0xe41f4f) : this.isNode() ? (this.data = this.loaddata(), this.data[_0xe41f4f]) : this.data && this.data[_0xe41f4f] || null;
    }
    setval(_0x284417, _0x2f6063) {
      return this.isSurge() || this.isLoon() ? $persistentStore.write(_0x284417, _0x2f6063) : this.isQuanX() ? $prefs.setValueForKey(_0x284417, _0x2f6063) : this.isNode() ? (this.data = this.loaddata(), this.data[_0x2f6063] = _0x284417, this.writedata(), !0) : this.data && this.data[_0x2f6063] || null;
    }
    send(_0x55e411, _0x11ebef, _0x186ed3 = () => {}) {
      if (_0x55e411 != "get" && _0x55e411 != "post" && _0x55e411 != "put" && _0x55e411 != "delete") {
        console.log("无效的http方法：" + _0x55e411);
        return;
      }
      if (_0x55e411 == "get" && _0x11ebef.headers) {
        delete _0x11ebef.headers["Content-Type"];
        delete _0x11ebef.headers["Content-Length"];
      } else {
        if (_0x11ebef.body && _0x11ebef.headers) {
          if (!_0x11ebef.headers["Content-Type"]) {
            _0x11ebef.headers["Content-Type"] = "application/x-www-form-urlencoded";
          }
        }
      }
      if (this.isSurge() || this.isLoon()) {
        if (this.isSurge() && this.isNeedRewrite) {
          _0x11ebef.headers = _0x11ebef.headers || {};
          const _0x228790 = {
            "X-Surge-Skip-Scripting": !1
          };
          Object.assign(_0x11ebef.headers, _0x228790);
        }
        const _0x2703d8 = {
          method: _0x55e411,
          url: _0x11ebef.url,
          headers: _0x11ebef.headers,
          timeout: _0x11ebef.timeout,
          data: _0x11ebef.body
        };
        if (_0x55e411 == "get") {
          delete _0x2703d8.data;
        }
        $axios(_0x2703d8).then(_0x4b728d => {
          const {
              status: _0x3f6824,
              request: _0x4687da,
              headers: _0x209357,
              data: _0x532c6d
            } = _0x4b728d,
            _0x3b713b = {
              statusCode: _0x3f6824,
              headers: _0x209357,
              body: _0x532c6d
            };
          _0x186ed3(null, _0x4687da, _0x3b713b);
        }).catch(_0x436840 => console.log(_0x436840));
      } else {
        if (this.isQuanX()) {
          const _0x107551 = {
            hints: !1
          };
          _0x11ebef.method = _0x55e411.toUpperCase();
          this.isNeedRewrite && (_0x11ebef.opts = _0x11ebef.opts || {}, Object.assign(_0x11ebef.opts, _0x107551));
          $task.fetch(_0x11ebef).then(_0x6a514e => {
            const {
                statusCode: _0x3f5d74,
                request: _0xbb01b3,
                headers: _0x3bd15b,
                body: _0x11213c
              } = _0x6a514e,
              _0x33617d = {
                statusCode: _0x3f5d74,
                headers: _0x3bd15b,
                body: _0x11213c
              };
            _0x186ed3(null, _0xbb01b3, _0x33617d);
          }, _0x582b50 => _0x186ed3(_0x582b50));
        } else {
          if (this.isNode()) {
            this.got = this.got ? this.got : require("got");
            const {
                url: _0x50c556,
                ..._0x163a97
              } = _0x11ebef,
              _0x46a928 = {
                followRedirect: false
              };
            this.instance = this.got.extend(_0x46a928);
            this.instance[_0x55e411](_0x50c556, _0x163a97).then(_0x150f17 => {
              const {
                  statusCode: _0x55df51,
                  request: _0x428a4b,
                  headers: _0x4dd331,
                  body: _0x1da11c
                } = _0x150f17,
                _0x411443 = {
                  statusCode: _0x55df51,
                  headers: _0x4dd331,
                  body: _0x1da11c
                };
              _0x186ed3(null, _0x428a4b, _0x411443);
            }, _0x5d408e => {
              const {
                message: _0x4cbe55,
                response: _0x17c8fe
              } = _0x5d408e;
              _0x186ed3(_0x4cbe55, _0x17c8fe, _0x17c8fe && _0x17c8fe.body);
            });
          }
        }
      }
    }
    time(_0xa88bdb) {
      let _0x4149b3 = {
        "M+": new Date().getMonth() + 1,
        "d+": new Date().getDate(),
        "h+": new Date().getHours(),
        "m+": new Date().getMinutes(),
        "s+": new Date().getSeconds(),
        "q+": Math.floor((new Date().getMonth() + 3) / 3),
        S: new Date().getMilliseconds()
      };
      /(y+)/.test(_0xa88bdb) && (_0xa88bdb = _0xa88bdb.replace(RegExp.$1, (new Date().getFullYear() + "").substr(4 - RegExp.$1.length)));
      for (let _0xa38e07 in _0x4149b3) new RegExp("(" + _0xa38e07 + ")").test(_0xa88bdb) && (_0xa88bdb = _0xa88bdb.replace(RegExp.$1, 1 == RegExp.$1.length ? _0x4149b3[_0xa38e07] : ("00" + _0x4149b3[_0xa38e07]).substr(("" + _0x4149b3[_0xa38e07]).length)));
      return _0xa88bdb;
    }
    async showmsg() {
      if (!this.notifyStr) {
        return;
      }
      let _0xe77b7d = this.name + " 运行通知\n\n" + this.notifyStr;
      if (_0x457fc7.isNode()) {
        var _0x1ed8a7 = require("./sendNotify");
        console.log("\n============== 推送 ==============");
        await _0x1ed8a7.sendNotify(this.name, _0xe77b7d);
      } else {
        this.msg(_0xe77b7d);
      }
    }
    logAndNotify(_0x3f8ee6) {
      console.log(_0x3f8ee6);
      this.notifyStr += _0x3f8ee6;
      this.notifyStr += "\n";
    }
    msg(_0x426432 = t, _0x1f0881 = "", _0x1899a9 = "", _0x8af376) {
      const _0x5ab3ce = _0x164fb4 => {
        if (!_0x164fb4) {
          return _0x164fb4;
        }
        if ("string" == typeof _0x164fb4) {
          return this.isLoon() ? _0x164fb4 : this.isQuanX() ? {
            "open-url": _0x164fb4
          } : this.isSurge() ? {
            url: _0x164fb4
          } : void 0;
        }
        if ("object" == typeof _0x164fb4) {
          if (this.isLoon()) {
            let _0x2565e7 = _0x164fb4.openUrl || _0x164fb4.url || _0x164fb4["open-url"],
              _0x27fbef = _0x164fb4.mediaUrl || _0x164fb4["media-url"];
            const _0x12fd50 = {
              openUrl: _0x2565e7,
              mediaUrl: _0x27fbef
            };
            return _0x12fd50;
          }
          if (this.isQuanX()) {
            let _0xa678e1 = _0x164fb4["open-url"] || _0x164fb4.url || _0x164fb4.openUrl,
              _0x1f5268 = _0x164fb4["media-url"] || _0x164fb4.mediaUrl;
            const _0x34740a = {
              "open-url": _0xa678e1,
              "media-url": _0x1f5268
            };
            return _0x34740a;
          }
          if (this.isSurge()) {
            let _0x151d86 = _0x164fb4.url || _0x164fb4.openUrl || _0x164fb4["open-url"];
            const _0x50b79e = {
              url: _0x151d86
            };
            return _0x50b79e;
          }
        }
      };
      this.isMute || (this.isSurge() || this.isLoon() ? $notification.post(_0x426432, _0x1f0881, _0x1899a9, _0x5ab3ce(_0x8af376)) : this.isQuanX() && $notify(_0x426432, _0x1f0881, _0x1899a9, _0x5ab3ce(_0x8af376)));
      let _0x2d6bef = ["", "============== 系统通知 =============="];
      _0x2d6bef.push(_0x426432);
      _0x1f0881 && _0x2d6bef.push(_0x1f0881);
      _0x1899a9 && _0x2d6bef.push(_0x1899a9);
      console.log(_0x2d6bef.join("\n"));
    }
    getMin(_0x251cfa, _0x46449c) {
      return _0x251cfa < _0x46449c ? _0x251cfa : _0x46449c;
    }
    getMax(_0x3926b4, _0x41104a) {
      return _0x3926b4 < _0x41104a ? _0x41104a : _0x3926b4;
    }
    padStr(_0x123390, _0x2fa22d, _0x2c4a2d = "0") {
      let _0x4a3fe5 = String(_0x123390),
        _0x340877 = _0x2fa22d > _0x4a3fe5.length ? _0x2fa22d - _0x4a3fe5.length : 0,
        _0x39ac6d = "";
      for (let _0x474853 = 0; _0x474853 < _0x340877; _0x474853++) {
        _0x39ac6d += _0x2c4a2d;
      }
      _0x39ac6d += _0x4a3fe5;
      return _0x39ac6d;
    }
    json2str(_0x3d42ff, _0x5d4208, _0x495382 = false) {
      let _0x27339a = [];
      for (let _0x2293b8 of Object.keys(_0x3d42ff).sort()) {
        let _0x346511 = _0x3d42ff[_0x2293b8];
        if (_0x346511 && _0x495382) {
          _0x346511 = encodeURIComponent(_0x346511);
        }
        _0x27339a.push(_0x2293b8 + "=" + _0x346511);
      }
      return _0x27339a.join(_0x5d4208);
    }
    str2json(_0x54fa6f, _0xc4c805 = false) {
      let _0x55720c = {};
      for (let _0x40c95b of _0x54fa6f.split("&")) {
        if (!_0x40c95b) {
          continue;
        }
        let _0xe36a9c = _0x40c95b.indexOf("=");
        if (_0xe36a9c == -1) {
          continue;
        }
        let _0xb5a16c = _0x40c95b.substr(0, _0xe36a9c),
          _0x1f1569 = _0x40c95b.substr(_0xe36a9c + 1);
        if (_0xc4c805) {
          _0x1f1569 = decodeURIComponent(_0x1f1569);
        }
        _0x55720c[_0xb5a16c] = _0x1f1569;
      }
      return _0x55720c;
    }
    randomString(_0x1aad46, _0x5819d3 = "abcdef0123456789") {
      let _0x514bcf = "";
      for (let _0x20472d = 0; _0x20472d < _0x1aad46; _0x20472d++) {
        _0x514bcf += _0x5819d3.charAt(Math.floor(Math.random() * _0x5819d3.length));
      }
      return _0x514bcf;
    }
    wait(_0x325ba9) {
      return new Promise(_0x102d22 => setTimeout(_0x102d22, _0x325ba9));
    }
    done(_0x4e55d9 = {}) {
      const _0x5053e9 = new Date().getTime(),
        _0x501ea0 = (_0x5053e9 - this.startTime) / 1000;
      console.log("\n" + this.name + " 运行结束，共运行了 " + _0x501ea0 + " 秒！");
      if (this.isSurge() || this.isQuanX() || this.isLoon()) {
        $done(_0x4e55d9);
      }
    }
  }(_0x4e7f4f, _0x4ca4c5);
}